{"train": [{"entity_a": "126127", "entity_b": "209365", "entity_a_summary": ["This all suite hotel is flawless. Around the holidays season, the hotel was well decorated for X-mas with lovely Palm trees and Christmas lights. This hotel is so close to the beach and is perfectly located for peace and quiet. The airport and Duval street is only a short shuttle away, but downtown is quite far away. Morden rooms with great size and a lot of storage space. The beds are super comfortable. The bathroom is also pretty large with a nice vanity area. The staff were even willing to help with last minute late checkout request. The restaurant provides great food, but it closes too early for us. The hotel actually has bikes to rent. Parking close-by can be very pricey per day. The elevators feel not safe.", "Overall, as an all-suite hotel, the place was great. It's not the fanciest, but it was beautifully decorated for Christmas with lights on the palm trees and it was very enjoyable. The hotel is just across the street from Smather's Beach and is only a short walk, shuttle ride or bike trip away from Duval street. The rooms are large and spacious with lots of storage space and are clean with comfortable beds and also have a big bathroom. The vanity is very nice and the room is spacious enough to kick back in but also close to one of the few beaches in Key West. In the restaurant, the staff was very good. If at all possible the staff tried to accommodate late checkouts for all who requested it. Fantastic service. Although the restaurant closed at 9 and the bar also closed too early for the crowd, at 11. The food and staff was great. The hotel's elevators are not recommended to be used. Parking in the Duval Street area is pricey but the hotel has plenty of bicycles that are available to rent too.", "The hotel is well maintained, functional and the decor is good. The hotel has a public beach, Smathers Beach, across the road. Duval Street and downtown is only an hour away and you can take the shuttle there too. every hour. The hotel is also close to the airport, If you own a bicycle it is a great location too. They were comfortable beds in a spacious room . Lots of storage available and a modern and clean environment. A large bathroom in the room too. The hotel provided excellent food but the restaurant closes at 9pm which may be a little early for some tourists. The only complaint would be that the elevators are scary. Parking on Duval Street ranges between $10 and $35 per day but the hotel has bikes to rent so parking costs can be lessened or avoided."], "entity_b_summary": ["It was overpriced here at this hotel and the cleaning standards were only okay. This hotel isn't in a great location because it was outside of the old town, which is where some good attractions are. Whilst somewhat nice to be away from the main strip it could have been closer to the main attractions. Some of the staff were rude and unhelpful. You can eat your breakfast at the outside restaurant when staying at this hotel, which is really enjoyable. This is a great stay and you can ask for a reduced rate if you are a Florida resident. The pool is really worth checking out, as well at the hot tub.", "The accommodation at the hotel was very comfortable and a fun atmosphere to be in on holiday. The hotel did seem expensive though. The rooms in this hotel are mostly clean and the beds were great. The hotel had an al fresco restaurant for serving breakfast, The hotel has a fantastic pool area and hot tub available. It is also worth mentioning that you can ask for a Florida resident's rate as well to save some money.", "Although the hotel is comfortable and fun, some may feel the need to stay elsewhere due to the price, lack of cleanliness and cockroaches. The hotel isn't as convenient to get to the old town but you may find it nice to be further away from the main strip. The rooms are generally clean and the beds are good. The staff have a great attitude and try their best to solve any issues that may arise. Florida residents get a residence rate and the hotel has a pool and a hot tub."], "common_summary": ["The hotel is recommended and the staff there were friendly and helpful to guests.", "This hotel is highly recommended especially because the staff provide a good service that is both friendly and always helpful.", "The staff at this hotel is very helpful."], "entity_a_uid": ["UR94089543", "UR76748734", "UR25114342", "UR120751181", "UR89044946", "UR10049301", "UR122993678", "UR97978053"], "entity_b_uid": ["UR102562150", "UR12147184", "UR124922743", "UR14401386", "UR102788431", "UR84563434", "UR119844086", "UR47457714"]}, {"entity_a": "614472", "entity_b": "156853", "entity_a_summary": ["The hotel has an enjoyable ambience and is great value for money. This location is great if you're looking to access the great fun and action close-by, but with that comes hustle-and-bustle noise from the street the hotel is located on. The rustic rooms here are a little small but really comfortable and clean while the beds are big. There was a thatched roof to the room that provided an airy feel but of course not soundproof. The hotel provides great breakfast to be eaten above the garden or to take away. The hotel does not provide private parking unfortunately.", "Playa del Karma is perfect for ambiance. It has charm, serenity, and is relaxing and pleasant. It is simply lovely and beautiful. The hotel is in close proximity to 5th Avenue Playa Del Carmen. The rooms are adequately sized, but comfortable, clean and with high-vaulted ceilings. Breakfasts were really good above the garden but also the breakfast-to-go option was great too. Unfortunately there was no private parking available here at this hotel.", "This hotel is excellent value for money, and offers a pleasant experience to be had with it's stunning garden and courtyard. A very charming atmosphere for guests to relax. The hotel's location is very conveniently located near 5th Avenue and Playa. It is a busy street so noise might be a factor to consider when staying here. The rooms are small and cosy in size, but they make it for it in character. The high vaulted thatched roof, although not soundproof, gives the room a much more airy feel to it and you can listen to the relaxing patter of raindrops. The quality of the rooms are exceptional, with lots of space, and big, comfortable beds for a good night's sleep. Breakfast could be taken on the go or taken above the garden. This hotel is lacking in private parking."], "entity_b_summary": ["The hotel is a highlight of the Yucatan province and is different to the commercial areas such as Cancun. The food at the hotel is highly recommended and in general the hotel's worth repeat visits. The location is absolutely perfect and is really close to shopping and restaurants options. The rooms are basic but the showers work well. The rooms are purposefully lacking in mod cons such as TVs, radios and phones. Uniquely, the towels provided in the room are sculpted into animal shapes. The two big-sized pools were perfect as well as some ping-pong tables. The internet accessibility is a bit of a let-down unfortunately.", "This hotel will provide a wonderful experience with a relaxing atmosphere and truly is a unique place to stay. The hotel is only around 45 minutes away from Cancun airport , with a shuttle service provided by the hotel. The rooms do not feature mod-cons like televisions, radios or clocks however the beds are super comfortable and the showers provided work really well. In the nighttime there was always a member of staff around as well, which gives a sense of security. The food provided was really good. The hotel has dome fantastic feature such as access to a beach, two swimming pools and a table tennis table. It is worth nothing that the hotel could improve its internet access and the surrounding hotels can be noisy too.", "This resort is beautiful and offers the most amazing experience. It is gorgeous and the gardens and landscaping are brilliant and peaceful and one of the most relaxing places away from the bustle of Cancun. The hotel location is only 45 minutes from the airport and within a couple of blocks fo the main shopping street. It is also within easy walking distance of 5th Avenue for shopping or eating. Some nice touches in the rooms are the sculptured towels - of animals. And the artwork in each room. Also nice, was a lack of items like TVs, radios, clocks or even phones. Very relaxing and there were hammocks as well. Besides that the bed is comfortable and there is also a sheltered porch. The staff at this hotel make it easy for their guests to feel safe and secure, with appropriate attendants on shift at all hours of the day. The food is good. The hotel is nothing like an all-inclusive place which was perfect although the internet access wasn't great and noise from surrounding hotels was too loud at times."], "common_summary": ["The staff at the hotel were friendly and helpful and it is very close to the beach.", "Staff in this hotel are always very helpful as well as friendly, which will definitely make you want to come back. The hotel is located just a short walk away from the beach, too.", "The staff at this hotel is very friendly and helpful."], "entity_a_uid": ["UR53050587", "UR95722252", "UR54995976", "UR18740645", "UR30939303", "UR54422616", "UR18488955", "UR24948828"], "entity_b_uid": ["UR114906076", "UR125190605", "UR123087340", "UR5025556", "UR3734162", "UR123227760", "UR99027780", "UR6816489"]}, {"entity_a": "232949", "entity_b": "229001", "entity_a_summary": ["This is a really great place to stay and it's really quiet. The station is really close to the hotel and it is located in an old monastery set in beautiful gardens. The rooms in the hotel are spacious, clean and with air conditioning. The food at the hotel is reasonably priced. The hotel lobby provides free wireless internet and you can also borrow one of their laptops if needed.", "The hotel was impressive and easy to get anywhere else. The hotel is close to the train station and the main lines of the canal, The hotel is very close to the Grand Canal and St. Lucia station. There is plenty of space in the hotel rooms and they were always immaculately clean. The beds are lovely here as well, and the air-conditioning functions were really appreciated in the summer. The food was a bit rich but reasonably priced. This is a nice quiet hotel that has free wireless, and the hotel will even provide one of their laptops to borrow to use this.", "A very impressive hotel to stay in that is highly recommended, and offers a lot of charm for its guests. This hotel is near the train station and one of the main vaporetti if you prefer a boat. It is located in an old monastery. All rooms of a good size, especially the family rooms. Good working amenities in each room and they have been cleaned to a high standard. It's highly recommended to eat the rich breakfast in the very charming garden in the mornings. The hotel does have issues with flooding, however there are boots available for guests to borrow if needed. Free Wi-Fi is also available at this hotel which is beneficial to many."], "entity_b_summary": ["This hotel is great value and definitely adds to make your trip really special and enjoyable. There were some great places within walking distance at this hotel. The hotel has well equipped and nicely decorated rooms but the rooms with views are rather expensive. The breakfast food items were really varied and very tasty, couldn't recommend enough, This hotel could be improved if there was a lagoon view.", "The hotel made the trip feel special but it was a little more expensive than your standard places. The hotel looks out onto the Saint Giorgio Maggiore . It is very close to the Bridge of Sighs and St. Mark's Square. Rooms with a good view are quite expensive but it is tastefully decorated with exposed beams. There are lovely touches such as turn-down service and chocolates left on the pillow. The rooms are perfectly equipped and include a couch and table. During a visit to this hotel the staff provided directions when required. The hotel's restaurant is situated on the lagoon and there is a varied selection for breakfast. The stay was good but a lagoon view could make the experience even better.", "This hotel is lovely for staying at for a special occasion as it can be quite expensive. However it is well worth the money for an enjoyable trip that is perfectly placed for a short break. The hotel is in a location looking onto the St Giorgio maggiore church island, the grand canal, and was only short walk to the bridge of sighs and St Marks Square. The rooms at this hotel are quite expensive, yet the rooms are considerably small. However, they are decorated to a good standard and equipped with all amenities. A lovely, multi choice breakfast for starting your day. The restaurant serving breakfast is also on the lagoon so you are able to sit outside and enjoy the sun while you eat."], "common_summary": ["The staff at the hotel were very helpful.", "Not only is this hotel greatly located but there are some great employees working here because they're so helpful.", "This hotel is in a great location and the staff is very helpful."], "entity_a_uid": ["UR10024115", "UR3812168", "UR63690608", "UR116841843", "UR79962488", "UR3886964", "UR12860863", "UR72407186"], "entity_b_uid": ["UR58857639", "UR14265141", "UR18232770", "UR27568340", "UR2806337", "UR122594665", "UR54126685", "UR120112429"]}, {"entity_a": "240831", "entity_b": "316644", "entity_a_summary": ["If you're looking for a decent clean hotel then this is the right one for you because it provides a pleasant and unforgettable experience. This is a nice location because you can even see the Colosseum from the hotel, which itself is less than a ten minute walk away. The rooms in the hotel are nicely decorated, although some may find the bed small. The day staff spoke English. The hotel has a continental buffet breakfast with good cappuccino available on the roof terrace. The breakfast is very tasty. The showers in the hotel bathrooms are a little small.", "The Apollo hotel is definitely worth staying at each time you are in Rome. The hotel is situated in close proximity to the Colosseum ( around seven minutes away) and around fifteen minutes walk to the Trevi Fountain. There are a lot of restaurants close by. The hotel is also in a good location to take advantage of the tram system. The room itself is of a good size with decent decoration but the shower cubicle and the bed are both on the small size. Most of the staff do speak English and therefore were able to explain all of the functions of the hotel. The food served here is really good and tasty. There is even a really nice coffee machine to add to the stay. The shower cubicle was really small so you can hardly turn around in there.", "A highly recommended hotel, that provides a pleasant experience for those visiting Rome. Even though it's rated a three star hotel, it's spacious, clean and has all the amenities needed for one's stay. This hotel is only a 7-minute walk to the Colosseum which is always within view. There is a wide variety of restaurants. In this hotel, guests will have either an apartment-style room away from the main hotel or a large room with a big bathroom in the hotel directly. Be aware of small beds and holes in the sheets though. Not all staff can speak English but the majority can, and they do so clearly. The hotel offers a very nice breakfast at their rooftop terrace dining room but there are grocery shops and restaurants nearby if you prefer something else."], "entity_b_summary": ["The stay at the hotel was comfortable and felt like a home away from home. Definitely recommended. The hotel is in a good location for a short walk to the main train terminus, as well as a tube line going to all the historic sites of Rome. The hotel is also closely located to a supermarket. The rooms in the hotel are clean and with a view . The breakfast here at the hotel was really good and had a great range from pastries to scrambled eggs. Very tasty.", "This three-star hotel met every need and truly felt like home-from-home. There are historical sites close-by and a large supermarket for groceries, which is really useful. The room was great. It was roomy and very clean with a great shower, although the shower was a bit small. The lovely staff were always helpful and lovely and will show you nothing but kindness. They will answer all your questions with the same level of friendliness each time. The hotel provided a Continental breakfast with all the usual fare, very good quality. ", "This hotel feels like home from the moment you check in to when you leave. The Raffaello Hotel is central and a great place to stay for your visit. It is near a large supermarket to reduce costs of food, not to mention other historical sites. The rooms are a perfect size and are well maintained throughout. Some rooms also have a balcony for guests to enjoy during their stay. "], "common_summary": ["The hotel is ideally located and good for local public transportation. The staff at the hotel were very helpful too.", "This hotel is wonderfully located and there is a metro station opposite the hotel. The hotel's staff were absolutely wonderful and took great care of everyone the moment they arrived. ", "This hotel is in a great location within walking distance to the trains, trams and subway. The staff at this hotel are very efficient and thoughtful towards their guests and help where they can. "], "entity_a_uid": ["UR63210514", "UR121262994", "UR74373664", "UR39032976", "UR117566230", "UR116602810", "UR77765196", "UR8256104"], "entity_b_uid": ["UR122866690", "UR94756217", "UR32971522", "UR31012600", "UR77712387", "UR94406761", "UR7480243", "UR46283917"]}, {"entity_a": "1413478", "entity_b": "90767", "entity_a_summary": ["This is a great condo that was comfortable, convenient, and much nicer than staying in a hotel. It would be a shame not to come back again. The location of the hotel is perfectly situated on the lake and there is the option to rent boats down at Indian Point if needed. Fantastic views. As well as being really helpful the staff at this hotel were super friendly and nice. The units facing the lake had large covered patios to enjoy your coffee on. There is only one complaint and that is the people in the room above were up all night long, but that is the only downside to this hotel.", "The hotel had an antiquated, rustic look and would definitely stay there again. The location is superb because it's right on the lake. It's a bit of a drive away if someone wants to go downtown but the roads are decent around this location. The 2 bed condos are big and offer a relaxing experience away from the Strip but some of the beds squeak. The staff at the hotel were very friendly and helpful. Coffee wasn't always available at the hotel, but when it was it was adequate. One complaint about the hotel is that there were people on the upper floors partying and made noise all night.", "This condo is much better than staying in a hotel. It has a nice rustic look nestled in the trees and is comfortable and convenient. The condo is at a great location on the lake where you can rent a boat but does require a drive if you want to go into town. Very comfortable rooms to stay in here, however the walls must be quite thin as it's easy to hear noises from other rooms close by. The staff were friendly and helpful. Large patios offer an enjoyable spot to drink your coffee when it's available. It was very noisy due to the other guests."], "entity_b_summary": ["This was an okay stay here with some really lovely scenery around the place. The spa facilities at the hotel were top-class so it made for a lovely atmosphere. The room was quite noisy and didn't even have a mini-fridge inside. The pull-out couch was actually really good quality and sleep was great on it. Most of the staff were great here and provided such a memorable service. The only let-down was the doormen and front-desk lady were sometimes rude but overall the staff were great. The food was a bit expensive but the cafe restaurant definitely has unbeatable food. The hotel had a movie theatre that even played kids movies. There was a lovely lake and an indoor atrium.", "The hotel has a nice spa available, but the facilities could have been better. The hotel room was adequately sized with a pull-out couch. Be warned that some of the rooms are noisy due to being located near to air conditioning units and a delivery door. Most staff at the hotel were accommodating and make the stay memorable, although there were some who were rude and dismissive. The food in the cafe restaurant was really good and the hotel bar is a great place to enjoy a drink in the sunshine. The food is a little pricey though. Not only is there a beautiful lake but the indoor atrium has chirping birds and a lovely trickle of water that you wake up to. There is also a movie theatre for your viewing as well.", "This hotel is not for everyone but perfect for others. The resort is beautiful and has a lovely spa. The people are nice and the facilities and scenery are excellent. The Chateau may not always feel welcoming so it may not be the number one choice for some who could be disappointed but it does make for a nice Spring Break destination and for some the resort will be perfect. Although some suites in this hotel are small, the pull out couch provided is of excellent quality for a good night's sleep. However, there can be an issue with noise in some rooms as they are next to the delivery area and the heating/AC units can be very loud. The hotel staff, for the most part were great although the woman at front desk was rude and the doorman was unpleasant, the overall experience was good. The cafe food was good but food was expensive. This hotel has some luxurious amenities that help make one's stay unforgettable. This includes an indoor atrium and a movie theatre to mainly entertain the kids."], "common_summary": ["The hotel was very comfortable to stay at.", "The rooms provide lots of comfort at this hotel.", "The rooms at this hotel are very comfortable."], "entity_a_uid": ["UR131506667", "UR68869649", "UR115231925", "UR115052324", "UR136434463", "UR84624204", "UR80857479", "UR79445477"], "entity_b_uid": ["UR15736424", "UR115536587", "UR131858460", "UR127373620", "UR38582604", "UR126712146", "UR71518663", "UR116586078"]}, {"entity_a": "155573", "entity_b": "573658", "entity_a_summary": ["The room featured WiFi and Apple TV, which was a great touch. Additionally the shower was excellent. The only negatives really are the pillows were pretty full and there was no refrigerator in the room. The staff at the hotel were polite and accommodating. The sales manager that was contacted was efficient in response and helpful with suggestions. There are great food options around the hotel but the breakfast in the connected restaurant was really great. The second floor of the hotel was recently refurbished and quiet.", "The rooms of the hotel are really modern and well kept. There is also free WiFi in the room . If you pay a little extra for the business room, you get Apple TV and a paper in the morning. One thing to mention is that perhaps the pillows were a bit too full. All members of staff were really helpful; from the Sales Manager to Housekeeping everybody was friendly and performed their jobs to a high standard. The hotel has an adjoining restaurant called Over Easy which serves great food. The hotel has recently been newly renovated and as a result there was no sound disturbances on the second floor.", "Generally very nice rooms that offer a variety of luxuries in the higher end suites. Each room has modern styling and decor, and the shower in particular is very good. Not only this, but unlike some other hotels it also provides free Wi-Fi in all rooms of the hotel. The sales manager at this hotel was very polite and prompt in responding via email when questions were posed and the rest of the staff were all very helpful and nice. Breakfast at the hotel was great but there is an assortment of restaurants in the area for other options and variety."], "entity_b_summary": ["This hotel has served guests who have stayed on repeated occasions. The room is very well-equipped and clean too, but the shower did often leak onto the bathroom floor. The breakfast in the hotel was a little expensive and there was no bottled water available in the room. The parking provided at the hotel is really expensive but in other aspects the hotel did provide good value.", "The rooms in the hotel were very clean with a well equipped kitchenette. However the rooms were rather dark and the shower leaked. The staff here are really friendly and absolutely lovely. Whilst there is no bottled water available for guests this hotel does supply a really nice breakfast. It does seem a bit overpriced, though. The parking at the hotel was highly priced.", "The rooms at this hotel are very modern and have nice furnishings and the bed is very comfortable. It came equipped with a good shower and kitchenette but the shower did spray and leak onto the floor. Overall the rooms were clean and nice and the views were generally good. The staff at this hotel are mostly lovely and friendly other than the concierge. Very nice breakfast but a bit expensive. Parking was very expensive at $30 a day."], "common_summary": ["The hotel is in walking distance to some of the sights and it is definitely recommended.", "The hotel is conveniently located for a short walk to good sights of the city. This is a really great hotel with great value for money. It's definitely a recommendable hotel.", "This hotel offers a lovely experience, and for an excellent price. This hotel's location is great in its convenience to being within walking distance of places like the Eaton Centre and is a recommended place to make your stay."], "entity_a_uid": ["UR63501092", "UR121884157", "UR120380593", "UR125042007", "UR121744025", "UR20346591", "UR48865485", "UR118443115"], "entity_b_uid": ["UR5718297", "UR78235184", "UR18601364", "UR23537833", "UR115999770", "UR51174249", "UR114646563", "UR7832278"]}, {"entity_a": "582667", "entity_b": "183778", "entity_a_summary": ["Overall the hotel is a really unique place to stay. The location is pretty good but doesn't have great access to a subway line. There's mainstream shopping and the theatre quarters close-by though which adds to how good the location is. The shower in the room was very modern. Most of the staff were friendly to guests. This hotel has a small restaurant that provides superb food that very proudly uses local and organic produce. The hotel has an archaic elevator which is a novelty.", "This hotel is a unique space for musicians and artists etc to hang out and perform, though some may find that a detriment to their stay. The hotel is ideally situated for socialising in Queen St West, as well as the theatre district and shopping areas. The hotel has great music and food available. The rooms are quite unique but a little disappointing, and the shower is like a horizontal MRI machine. However the beds are great. Aside from the unfriendly reception staff most of the hotel staff were very nice. The hotel has great food; from the small restaurant to the fry bar that promotes local organic produce with lots of variety. This is a great escape even in the city. The very old elevator was also crazily fun.", "The Gladstone Hotel Toronto is located in an old building. It is geared towards musicians and artists but allows for foodies and families alike to indulge in performing or showing off their talent too. The location of the hotel isn't the most convenient in regards to the subway, but it is close enough to some amenities and mainstream shopping. Pleasant rooms, with a unique and fun design. The beds are reasonable, and there is the option to upgrade if guests would like to do so. The staff are mostly really nice and cool apart from upon arrival where the staff at that time were frosty. You can get great food from the small restaurant inside the hotel. The Gladstone has a great vintage elevator dating to the turn of the 20th century."], "entity_b_summary": ["Despite being quite a busy hotel it was really quiet. The location of this hotel is perfectly situated for exploring downtown as well as good for a medium-length walk to other attractions and sights. The hotel rooms were spacious and clean. The bathrooms were large and the room had really good bedding. The staff here at this hotel seemed a little bit uninterested but the housekeeping staff did do a really good job cleaning. The hotel had a good choice of food with a lovely breakfast and good curry lunches. The hotel has an ice machine available for guests in the room corridors.", "A nice touch is that the spa next to the hotel give a discount if you provide them with proof of a hotel stay. The hotel is close to all of the major downtown sights and travel in the centre of Toronto. It is a short walk to the Eaton Centre and around 25 minutes' walk to the CN Tower. The room at this hotel was pretty big and featured a nice big bathroom with marble-top unit. The breakfast here at the hotel is really good and varied for choice. There was also a bar to drink and dance in, too. There were ice machines in the corridor for guest use, which is great if you like your water cooled down.", "Tthe noise levels is surprisingly low for such a busy hotel. Although the restaurant can be expensive, there is a spa on site that also offers discounts to guests staying here. The location of this hotel is perfect for those that want to be close to all amenities, as it based in the city centre of Toronto. It is also walking distance to many of the major attractions in this area which is ideal. Rooms at this hotel are very spacious and cleaned to a high standard. The amenities provided were of an excellent quality and the bedding in particular was very nice. The staff at the hotel were not very interested in their guests. The food at this hotel is of great quality, whether you're eating there during breakfast, lunch or dinner, and it is also affordable dining. There is a great selection on offer for breakfast especially. There is an ice machine in the corridor which is good."], "common_summary": ["This hotel provides an overall enjoyable stay. It is definitely recommended.", "The hotel is a great place to stay and it is a recommended hotel.", "This hotel is very recommended and it is an excellent hotel to stay at."], "entity_a_uid": ["UR8231739", "UR67106198", "UR116059782", "UR49523665", "UR119079324", "UR90719231", "UR38524401", "UR67102095"], "entity_b_uid": ["UR120358096", "UR78841447", "UR118883310", "UR97838707", "UR119260323", "UR120646395", "UR38351482", "UR8718478"]}, {"entity_a": "115265", "entity_b": "93034", "entity_a_summary": ["Some would recommend the hotel to others, although some may not. The hotel is ideally situated for transportation routes like the St. Charles line but also in walking distance of the Garden District and a bit further to the French Quarter. The hotel has spacious rooms equipped with a kitchen. The rooms are very clean but the bathrooms are rather small. The shower was excellent. The staff at the hotel were incredibly helpful , particularly the welcoming porters. There is lots of great tasting food available to eat around this hotel. The hotel provides wristbands for entry into the premises which is a pleasing security feature.", "This is an okay hotel within the amazing city if you are visiting. The location is absolutely perfect because there are fine-dining options nearby as well as great shopping. Additionally there are good transportation links if you would prefer. The room was large and featured a great shower in the slightly smaller bathroom. There were great amenities here such as a refrigerator, stove, coffee pot, and others in the small kitchen attached. The staff make sure you have everything and go out of their way to be helpful, treating you like royalty every step of the way. They're really nice. There is an added level of security with this hotel because you need hotel-supplied wristbands to enter the hotel building.", "If you can get a room which isn't overbooked this is a great place to base yourself to explore this amazing place. Excellent location as it is central to many of the major attractions in this area. You can simply walk to get to many places, and it is a great base to start at before going to explore what else there is on offer in the area. Rooms are very spacious with all amenities that are needed for a good night's stay. The rooms are slightly outdated but still look reasonably modern and are maintained to a good standard. Extremely friendly and helpful staff at this hotel, who are very attentive to the needs of their guests and go above and beyond to make them feel welcome. Hotel security requires seeing wristbands provided to its guests in order to enter the building."], "entity_b_summary": ["The hotel and the surrounding area are noisy but that is to be expected. The location is unbeatable here. There is some noise but this is a small price to pay for having the best location. The small room wasn't too well maintained and upon arrival it wasn't even made-up. Despite requesting a quiet room the room that was provided was really noisy. The staff seemed unprofessional and unhelpful. The breakfast provided by the hotel was very good. The parking situation is quite difficult because the pricing is really high per day. Additionally there was no hot water and instead was just tepid.", "It is mostly a nice hotel that is pretty classy however there can be some noise late at night from the rowdy crowds elsewhere. Due to the location of the hotel it can be a little noisy at times. The hotel had rooms available that opened onto the courtyard. The rooms were small and noisy. The staff didn't provide much of a service at this hotel and amazingly didn't seem to even know where the closest hospital was. The food provided at breakfast really is great. The garage parking at the hotel is expensive. There was an issue with the water being only lukewarm too. It is worth mentioning that there were a lot of convention attendees making a racket in the hotel in the early morning.", "Splurge a little to get the Bourbon Street balcony room, it's worth it. It's noisy with crowds and music but that's expected. This is a great place to stay. The location of the hotel is unbeatable. The rooms at this hotel were small and at times noisy. Housekeeping did not clean it until prompted by an angry call. Bad quality service provided at this hotel, and the staff seem to be unaware of the location of amenities such as the closest hospital. Parking at this hotel is both difficult and overpriced for the size of what is more so a garage. There also seems to be an issue with the hot water at times."], "common_summary": ["This was definitely a great hotel.", "This is such a great hotel to stay in.", "This is a great hotel."], "entity_a_uid": ["UR73674719", "UR103596297", "UR136532226", "UR125807374", "UR127951644", "UR133183190", "UR12450489", "UR48255809"], "entity_b_uid": ["UR134258063", "UR622309222", "UR622286100", "UR771560900", "UR304319445", "UR967875696", "UR448088873", "UR999398194"]}, {"entity_a": "258872", "entity_b": "228969", "entity_a_summary": ["This hotel makes for a really pleasant and delightful stay. You wouldn't want to stay anywhere else if returning to Venice. The hotel is perfectly situated to get to great restaurants and it's close to water-ferry stations. The room in the hotel had a spacious, newly decorated bathroom and a quiet room in general. The rooms are decorated with a respect for history. The breakfast was a little bit basic but it was still a good start to the day with continental-style yoghurts, cereals etc. The hotel is great value for money.", "The Locanda Sant'Agostin is the perfect hotel venue for a stay in Venice, highly recommended. The hotel is situated in the centre of Venice and away from all of the usual tourist traps there. The rooms are really quiet but somewhat cold. There was old-world charm to the room's decor but the bathrooms were modern as they had clearly been recently upgraded. The hotel provided a basic Continental breakfast, with yoghurts, coffee, cereals and pastries.", "The Locanda Sant'Agostin is a very nice and pleasant hotel. What a location! Right at the heart of Venice in a quiet situation and within walking distance to all of Venice but away from the usual tourist areas. The rooms were brilliant. Decorated in a charming old-world way and spacious, quiet and comfortable.he hotel offers a basic continental style breakfast."], "entity_b_summary": ["The hotel is really well-placed in a quiet spot however only a few minutes' walk away you can access public transportation and go further afield if desired. The size of the rooms in the hotel differ but do have a canal view. The breakfast food here was plentiful and you can choose to eat your supper overlooking the canal to provide a magical experience. The hotel looks exactly as advertised on their website and the checking out process was very efficient.", "This is a nice hotel that lives up to all the photos you can view on their website. The hotel is closely located to the Vaporetto station and ideal for those tourists who are cruising. St. Mark's Square is about an hour's walk away. It is located just 15 minutes away from the airport. The rooms are a little on the small side but do provide a nice view. Owing to very little noise it was fine to keep the window and shutters open. Inside the room it is beautiful.The restaurant Brucinellis in the hotel was okay but the view overlooking the canal was great. The photos are very reflective of how this hotel is in reality. It's really convenient that they let you leave your luggage there when checking-out so you can do other things for a while.", "The hotel's advertisement was spot on and exactly as promised. The hotel is closely located to trains, buses and the waterbus or the vaporetto station is within easy walking distance too. A great location for cruising. The tooms tend to be small but beautiful and have nice views onto the canal. The food was ok but not great. This hotel is just as good in person as it is in its photos and website. They allow you to leave your luggage with them after checking out which is very convenient."], "common_summary": ["The staff at the hotel are friendly and the hotel is recommended.", "Staff at this hotel could not have been more helpful and friendly, which really does make this hotel highly recommended. The hotel was really clean, too.", "This is a highly recommended hotel with very friendly and helpful staff."], "entity_a_uid": ["UR30731432", "UR16702299", "UR93832269", "UR59058085", "UR24617858", "UR4412564", "UR69436828", "UR27939095"], "entity_b_uid": ["UR50970241", "UR50211189", "UR124932374", "UR122534970", "UR119351456", "UR92329385", "UR45824347", "UR118780739"]}, {"entity_a": "87052", "entity_b": "87095", "entity_a_summary": ["This is a decent place to stay and will leave you feeling happy overall. Initially there was a bit of a rough start here at the hotel but still a nice hotel. There is some peace and quiet here at this hotel but it is still quite close to the action with restaurants and shopping nearby. The room was clean with adequate disabled access , but it may take a while to get access to the room. The staff here are okay and mostly very helpful. They do enforce valet parking however which is a little offputting. Dinner at this hotel was really good and pleasing. There are also other food options nearby such as a restaurant that serves Italian food. There was a small outdoor patio which unfortunately overlooked the pool and other patios and that made it quite noisy. There are valet and parking services available too.", "Staying at the hotel is generally a good experience, but it can be noisy and its cleanliness needs improving. The hotel is situated close to the beach and is on the far side of Waikiki so it is a little quieter than the centre . After receiving an upgrade when the first room was unacceptable the King sized room was okay but nothing special. The room was clean, at least. The concierge at the hotel was helpful with arranging transportation to Pearl Harbor. The food available at the hotel's restaurants was good. The hotel had expensive enforced valet parking . There was a small patio outside that overlooked the pool.", "The hotel is a very nice place and clean, perfect for germaphobes. It's perfect for honeymooners and there are tour buses if you'd like or you can simply visit the onsite dining and hospitality features. It has two restaurants on offer and a sports bar, but little to no parking available. The room offered partial views of the ocean and was okay. It was clean but a small though the handicap access was good and comfortable. The bell desk were helpful to arrange transport. The food served in the restaurant is lovely, but if you want a change of pace there are a variety of other options available in close proximity to the hotel. Parking at the hotel could have been clearer as it was implied that valet was enforced when self-parking was available but either option was expensive."], "entity_b_summary": ["The hotel has a deal that you get the fourth night free if you stay three nights. The hotel is in close proximity to a zoo and aquarium, amongst other tourist sights. The hotel room overlooked the city., diamond head and the zoo. The room and bathroom were an adequate size but could generally do with a deep clean. The staff at the hotel were friendly and knowledgeable for the most part, although there were some that were not as helpful. There were free buffets every single day at this hotel, which has to be taken advantage of! The tiles around the hotel's swimming pool are very slippery, so caution is advised if using the facility.", "Whilst not the most luxurious hotel it is still a really good stay here and recommended based on the affordability. Convenient location for closeness to shops, the zoo, and the aquarium. The view from the room at this hotel was great however it didn't make up for the tired decor and the low standard of cleaning here. The staff service was pretty good and they clearly know lots of information about the area. The hotel provides a complimentary buffet. The hotel has got a pool but unfortunately the tiles there are really slippery and quite a hazard. Other facilities are adequate enough.", "This hotel is no luxury hotel but is okay. This is a perfectly located hotel if you wish to be near the zoo, aquarium and if you wish to go shopping. It's easy to find and the view from the hotel is great as well. The rooms at this hotel can be nice with views of the city or the ocean and even the zoo and even have good-sized bathrooms but other rooms have issues with smelling of mold and rooms and bathrooms in need of updating and cleaning. Staffing at this hotel is okay. They are knowledgeable and friendly but not extraordinary. As part of your stay, a free buffet is on everyday for guests to help themselves. This hotel has adequate amenities."], "common_summary": ["Great location near the beach.", "The hotel is situated close to the beach.", "This is a perfectly located hotel if you wish to be near the beach."], "entity_a_uid": ["UR303846718", "UR796906663", "UR746126125", "UR491847438", "UR979506483", "UR272029364", "UR656983860", "UR273835009"], "entity_b_uid": ["UR441589062", "UR477554187", "UR381999514", "UR234768236", "UR489426534", "UR424391762", "UR490053627", "UR701793924"]}, {"entity_a": "229156", "entity_b": "1946024", "entity_a_summary": ["The hotel is nicely located in a quiet canal street with being only walkable distance to many interesting places like Dam Square and Anne Franks House. While the room is quite small, the view of the canal was wonderful. You should try to request a large rom, although the small room did have a big enough bathroom. The staff at the reception and breakfast area were rude and not very helpful. Although with a reasonable price, the breakfast has very limited quantity and the food tasted funny. The shower was scallding dangerously.", " The hotel is just off the main street in central Amsterdam on a quiet canal street in easy reach of everything. It is within walking distance of Leidslein, Dam Square and Anne Frank's house. Although the room was small, it does have a big bathroom. Also, it did offer a view of the canal and the city was close so hardly any time was spent in the room. Although some of the staff were pleasant they were very laid back and uninterested. Other staff in reception were snooty. Prices were fine for breakfast but there was not a lot on offer as food kept running out. Additionally, the pastries were stale and the eggs were not good. The shower came off of the wall and whipped around dangerously with scalding water spraying everywhere.", "This hotel is central and close enough for convenient trips to the dam. A fantastic location just a short walk away from Leidsplein, the Herengeraacht canal and the Dam Square. It is also close to the tourist site of Anne Frank's house. The hotel is situated directly on a quiet canal street, and close to the main street of Central Amsterdam. The hotel room was quite small but adequate for a short stay. The bathroom was large and there was a good view of the canal . The hotel's staff are generally pleasant and well-mannered, although there are some who seem casual and less helpful and professional. The breakfast provided by the hotel was sometimes out of items and had some poorer quality items available. The price for the food is reasonable. The shower in the bathroom was very hot and not attached appropriately. Management dealt with this when confronted."], "entity_b_summary": ["The hotel is close to the Metro and train stations, with a great view from the balcony. The hotel is also right next to Central Station. Despite some issues with the room not being cleaned despite asking repeatedly for it to be, the rooms are stylish and give you great views. The bed is incredibly comfortable and the room even has Apple TV in it. The staff at the hotel were very polite and apologetic for any problems although no compensation was offered. The breakfast provided by the hotel was really good, although took a little longer than expected sometimes. The sky lounge of the hotel is recommended but can be expensive. The towels provided by the hotel turned up later than requested.", "This hotel is superbly located near the train station and there is a great view from the hotel. Additionally there are good tourist attractions nearby. The hotel room was just right. The beds are very comfortable and the provision of Apple TV is a nice bonus. Please note that on some occasions the room was not cleaned despite asking for that. Staff are polite at all times. The drinks here at this hotel are really expensive, but the sky-lounge at the very top of the hotel is really good and a must-eat. However food at this hotel did take a long time to come out. Unfortunately the towels took a long time to come to the room.", "The hotel is central to everything. A great place to celebrate a birthday and the sky lounge was very relaxed. This hotel is awesome for location. Close to the train station and the Metro. Views from the balcony are great and it's close to so many tourist attractions. The rooms are great and provide excellent amenities, including an Apple TV. The bed is also very comfortable. The staff at this hotel are all polite. Breakfast was great but the food did take longer than expected to arrive."], "common_summary": ["This hotel is worth the money because the stay was exceptional. The staff at the hotel were very helpful and friendly.", "The hotel is very good value for money. The staff here were always so helpful with a friendly vibe to them as well. In addition the hotel is in a really good location.", "This hotel is great and chances are you'll want to stay again. This hotel is in a great location and the staff is very helpful and friendly."], "entity_a_uid": ["UR34690226", "UR79496765", "UR4996139", "UR125988505", "UR96799211", "UR63057713", "UR114278994", "UR20463140"], "entity_b_uid": ["UR116169401", "UR122886870", "UR124713004", "UR124801118", "UR123516215", "UR123776902", "UR117315378", "UR128134720"]}, {"entity_a": "123519", "entity_b": "93247", "entity_a_summary": ["Really recommended to anyone. This well-maintained hotel has good facilities, upscale but cozy vibe, and lovely courtyard and pool. This hotel sits in a perfect location and in walking distance to all the key landmarks. The rooms are clean and the bed is super comfortable. The only issue was the shower in the bathroom, which would spray outside the stall. The service was outstanding in general; the staff here at this hotel are both helpful as well as professional. But there were some small teething problems , for example the housekeeping staff don't work after midnight. The hotel offered really chocolates and gingersnaps in the lobby and free breakfast. Lovely pool area. The valet parking should be provided.", "Hotel le Marais is a new, clean, modern boutique hotel. With a courtyard and pool, it feels very upscale but is cozy and non-pretentious. It has good facilities and is well maintained and offers a memorable experience you'll want to experience again. The hotel is in a great location only 1/2 block away from Bourbon Street. Key landmarks and local galleries are within walking distance. This hotel can boast of having heavenly beds and clean rooms but the shower sprayed outside of the shower stall and caused puddles on the floor. The staff and service were great although there is no housekeeping after midnight. The front desk staff was outstanding though and overall the staff was very pleasant and helpful. The hotel offered ginger snaps in the lobby and free drinks to guests plus in the room there was free bottled water. Breakfast was also offered free. The hotel shouldn't need to be asked to refill the shower gels and should offer valet parking.", "The hotel has a comfy charm and a modern, upscale feel to it all. The hotel has good facilities and is clean and well presented. The hotel is in close proximity to Bourbon street and in perfect walking distance to all the sights. You can walk to local art galleries and antique places too in the quiet neighbourhood. The room was well arranged but could have been cleaner. The beds were comfortable but in poor condition. The shower room would leak outside the cubicle unless the shower head was positioned appropriately. In general, the staff of the hotel are very helpful and offer good service. The hotel itself is in its infancy, so some of the service can be improved in future. The hotel provides free drinks for guests including bottled water in the room. There are also chocolates and ginger snaps provided in the lobby. A breakfast is provided free of charge. The hotel would benefit from valet parking being included. The cleaning staff would forget to refill the shower gels, although a call to management remedied this. The hotel has an inviting pool area which is great to relax in come evening."], "entity_b_summary": ["The overall vibe of this place is pretty great and authentic to the city. It's a neat spot and puts in a huge effort. Some of the rooms in the hotel do not have windows and furnishings are in a bad condition. The cleaning of the rooms could be improved. The management of the hotel seemed disinterested , but the valet staff and desk staff were efficient and friendly, despite being busy. The hotel only serves coffee and pastries as the breakfast offering . The hotel was cheap and had free parking included, but they were not reason enough to choose it.", "The hotel is an old historical building but with genuine decor befitting New Orleans. Very authentic. This hotel is located to everything you need in New Orleans and not far from Bourbon Street. The rooms were of an average quality, with rather basic furniture and facilities. The cleanliness of the rooms aren't to a very high standard either. The stay started off well because the valet staff are efficient and despite being really busy they maintained a friendly attitude. The front desk staff were also attentive and lovely, but the management let the staff down because they were clearly disinterested in tending to customers. The breakfast options were really limited to pastries and some coffee. Despite inexpensive rates and free parking this hotel is potentially dangerous; there are bed bug infestations that can leave you with huge itching welts.", "With it being an old, renovated warehouse, this is not your typical hotel and the decor may not suit all tastes. However, as it is still a work in progress the rates are competitive. This hotel's location is unbeatable because there are lots of charming places to eat and lots of local classic sights are nearby. The rooms in this hotel are generally windowless, horrible and in bad condition. They were not very clean and the furnishings are in need of replacement. Management at this hotel was less than interested in customer service but the valet staff were prompt and friendly and front desk staff were prompt to help with a smile. The hotel claims to serve breakfast but only serve pastries and coffee. The beds contained bugs and though the rates were low and the parking free it was not worth it."], "common_summary": ["The staff at the hotel are friendly and the hotel is ideally located for a stay. and to visit the French Quarter etc.", "The hotel is located near to the French Quarter and other attractions. The staff were always welcoming, friendly and helpful too.", "This hotel is located in the heart of the French Quarter and has very friendly staff."], "entity_a_uid": ["UR108323947", "UR124131925", "UR104807981", "UR138700596", "UR130922961", "UR133474960", "UR116521364", "UR115304978"], "entity_b_uid": ["UR343346777", "UR824751383", "UR219399455", "UR641338141", "UR360378000", "UR830729336", "UR133956635", "UR172357368"]}, {"entity_a": "248931", "entity_b": "228968", "entity_a_summary": ["It is a charming European hotel. The hotel is situated on the River Arno and is a quiet locale. The hotel rooms were well decorated and with fully functioning air conditioning. It was definitely a room with a view. The staff here at this hotel are really great and the manager was also really knowledgeable for local outings. They all work hard to please and meet your needs. You can access the internet via a computer in the hotel lobby and this is a free option. There is also a great hotel balcony, which was lovely to sit on and watch the world go by.", "A charming hotel that is on the smaller side, however one of the best hotels you'll find in the area. It's also based in the centre of the city, so it is an excellent base for people to start from when sight seeing. The view is great because the hotel is set in such a beautiful location. There are transport links nearby however it is only a ten minutes' walk to the city centre. Whilst the room had a really good view in this hotel, the beds were incredibly hard. The staff at the hotel were very friendly and useful to help with directions and tourist information. You can also have a drink in the lobby before going to dine, or there is also a rooftop balcony in the hotel with a view of the Arno below. The hotel provided free internet access via a booth terminal in the lobby.", "This is a charming and central hotel that is such a gem of a find. It's comfortable and all you would hope for. Great location near the Arno and within easy walking distance of the city center. The area is clean and quiet and away from the business of the city attractions and so is peaceful. The rooms are beautifully decorated and are an excellent size, especially compared to other hotels in this area. The bathrooms in particular are particularly large. A small, close knit team yet extremely knowledgeable and helpful in accommodating their guests; whether it be directions, taxis or restaurant recommendations to name a few. The staff are always polite and friendly and they work very hard to meet everyone's needs. This hotel is a lovely experience, offering beautiful views from the hotel balcony. Not only this, but this hotel also provides a computer with free internet access for its guests."], "entity_b_summary": ["This hotel is quite old compared to pictures on their website. Generally it's a okay hotel. The hotel is in a good location. It is close to the train station and the main attractions in Florence by foot. There are also nearby buses that go to Fiosole, the plaza Michelangelo and the discount mall. The rooms are rather small and unsafe. Some rooms are facing onto a construction site. The staff at the hotel had an unprofessional attitude towards guests. The hotel was quite noisy.", "This hotel seems older than its website's information suggests and is not recommended. Arriving by train makes it easy to access this hotel. It's ideally situated because you can access plenty of attractions by walking there but it's also really close to buses if wanting to go further afield. The rooms aren't big and some will face a construction site. Furthermore they aren't even safe. The staff were not terribly helpful and would keep people waiting during checking-in and checking-out. There was no apology after an incident and generally the hotel staff gave a no-care attitude. You get what you pay for in this hotel - the sound insulation was lacking and there were cigarette butts just left on the balcony.", "The hotel website doesn't portray the hotel very well and is older than the picture show. Some will be put off by this but it is a nice hotel. The hotel is in a great location, close to the bus station going to Fiosole, plaza Michelangelo and Florence for some discount mall shopping. It's perfect if arriving by train as is within walking distance from the station. Other attractions are also conveniently reachable by foot and the hotel has a good price. The rooms at this hotel are particularly small, apart from the handicap rooms. The views were also of a construction site which isn't the nicest. The service at this hotel is generally quite poor, with a no-care attitude towards its guests. The dining in the restaurant for dinner is equally as good. All for a decent price. For a cheap hotel, it isn't a bad quality. However the sound insulation could be better."], "common_summary": ["The rooms in the hotel are clean. The breakfast had a lot of choice which was really great. ", "The rooms were spotlessly clean. The breakfast here is really good and provided a surprisingly good selection. ", "The rooms are very clean. A lovely variety of foods on display for breakfast at this hotel."], "entity_a_uid": ["UR655427041", "UR431758122", "UR768233918", "UR827462360", "UR747463556", "UR578284784", "UR450489091", "UR276869644"], "entity_b_uid": ["UR154138659", "UR517225459", "UR106894451", "UR139497348", "UR138954845", "UR544165329", "UR595776029", "UR391882936"]}, {"entity_a": "87571", "entity_b": "87654", "entity_a_summary": ["The hotel is ideal for a boisterous and young crowd, such as a girl's trip. The hotel is close to bus routes into the city and is a good change of place to stay from the downtown alternatives. The hotel is located in the centre of Lincoln Park with restaurants and a good night life. The hotel itself is located on Clark Street which is a shoppers' delight. The hotel has double beds in the single rooms which is great for one or two people. The rooms are very clean although the drain in the shower needs some attention.The hotel provided a good breakfast to guests. The hotel has good security, as your key card is needed to gain access to elevators or stairwells. There is free WiFi provided too. There was some street noise but not loud enough to cause concern. It is worth mentioning that it is difficult to park for the valet out front of the hotel.", "This clean and affordable hotel is really nice and quite clean too. There are buses into the main city from this hotel so it is well-connected. There is also a major shopping street very close so the hotel is really conveniently located. Lovely rooms to stay in, particularly for one to two guests per room. Rooms are spacious and cleaned to a good standard. The bed is especially nice, as it is very soft and four pillows are provided, regardless of whether one or two people are staying. The breakfast is super tasty here at this hotel. The hotel provides free WiFi which is great. There's added peace of mind here too because the room key needs to be used to access the elevator or the stairs, therefore providing added security to guests. There was little street noise, too, but there was some difficulty in getting valet parking though.", "This is generally a nice hotel for the price. It is clean and in an upbeat area popular with the younger crowd. The hotel is located on a major shopping street, Clark Street and Century Mall is nearby which offers parking. There are also bus lines close by and many restaurants and bars to choose from. The rooms were always very clean even if you turn up slightly early. The sheers are lovely and soft and there are plenty of pillows. The room actually had a fridge and micro which is great because the building seems old but rooms are so modern. The hotel offers a great breakfast. This hotel offers free WiFi and additional security to get into the hotel but it can be difficult to park at the front for valet parking."], "entity_b_summary": ["This is a delightful hotel that provides a really nice place to stay . It's inexpensive and will keep you wanting to come back frequently. This hotel is located in a quiet area that is not too far away from great sights to see. The room in this hotel was modern and well-decorated as well as comfortable and spacious. The bathrooms are just as fabulous that was really well-equipped. The hotel had a small variety of food items to choose from. There are some great features to this hotel including flat-screen televisions and really lovely down-feather duvets.", "The hotel is quite expensive and a new hotel is currently being built. The hotel is very accommodating. The hotel is situated in a great location on the Gold Coast near to the pier, Michigan Avenue and State Street. The rooms in the hotel are modern and comfortable. There is also free WiFi available to guests. The bathrooms are also a highlight. Everybody from the bellman to the front and concierge desk were ever so gracious and will greet you warmly when you arrive. Even late at night the staff are still so cheerful. The menu did not have much to offer. The hotel provided some nice extras which were a bit more of a personal touch than the regular neutered norms of the large hotel chains. Things such as fluffy down duvets, flat screen televisions, iHome alarms etc. All great additions.", "Delightful hotel, and although it's not cheap, it's a much fairer price than other hotels in the vicinity. This hotel offers a terrific location near Michigan Avenue, State Stree and Navy Pier and within walking distance of Hancock Tower and the Sears Tower not to mention the many restaurants close by. Rooms are extremely spacious, with a modern decor. Rooms are very comfortable and well equipped with essential amenities for each person's stay. The fluffy down duvets are particularly nice, and free Wi-Fi is available in all rooms too. The menu at this hotel was varied in terms of dishes' cuisine-type but it was also quite limited. Extra features of the room were things you would only normally see from a luxury hotel such as the electrical equipment; flat-screen satellite TV's, ihome alarm clocks etc."], "common_summary": ["The staff at the hotel are amiable and helpful.", "The staff are always willing to help with their friendly attitude.", "Staff at the hotel were very friendly and helpful."], "entity_a_uid": ["UR77971269", "UR74695417", "UR117254535", "UR55133354", "UR75107538", "UR20652356", "UR21978960", "UR10055193"], "entity_b_uid": ["UR69057684", "UR6563900", "UR42388523", "UR115069352", "UR90305991", "UR84833902", "UR73519054", "UR36058833"]}, {"entity_a": "301583", "entity_b": "302109", "entity_a_summary": ["The hotel is beautiful but expensive. There are normally a lot of guests at the hotel as it is popular. The rooms in the hotel are comfortable and come equipped with a DVD player. The service was truly exceptional from the staff who were all always pleasant. The hotel did not provide much selection of food or anything that was really fresh. The hotel has signature peanut shells on the floor which are a slipping hazard. The toilets around the corner are below Singapore standards.", "This is a no-brainer - it's the best hotel to stay in and is absolutely beautiful. The bed was super comfortable and the water pressure was strong in the bathroom. Additionally the room features a DVD player that came in really useful when it rained so much. The staff at the hotel were very pleasant to guests., The food was disappointing. The experience here involves peanut shells on the floor - in fact it is a tradition at this hotel!", "Although expensive, this hotel is worth every penny with the beautiful decor and top-class restaurant. It is a very popular hotel with crowds and queuing at the door. The room had a very comfortable bed, great water pressure in the shower and even a DVD player for those rainy days. The service provided was of a very high quality, and the staff at this hotel were very pleasant to be around. The restaurants are mostly great but the afternoon tea will leave a lot to be desired."], "entity_b_summary": ["This was a great stay and recommended for both business and/or pleasure. The hotel is situated close to the Orchard Road shopping area and provides a free shuttle service. The rooms here are absolutely amazing and cleaned to such a high standard. The rooms are really spacious, comfortable and stunningly luxurious. All members of staff were superb and couldn't possibly be better. Everyone had great attention to detail right down to the taxi-hailer. The breakfast options here are great and comes in a buffet-style selection, which was all tasty. Additionally the afternoon tea and canapes were really nice and appreciated. The hotel has a gym and a swimming pool along with free Wi-Fi access. There is cold water and iced face towels around the pool.", "This hotel is an ideal stay for those seeking both business and pleasure and with a few extras that aren't typical of most hotels in Singapore. This hotel isn't exactly central but taxis are pretty cheap and the hotel also provides a shuttle service for free. There is a large shopping area within walking distance as well. The rooms in the hotel were large, spacious and luxurious. The rooms were really clean with quiet air conditioning a pleasant surprise. The staff at the hotel had good attention to detail and the member of staff outside the hotel would always hail the taxi for guests. The hotel is all inclusive and guests receive free champagne in the lobby. The expense of the rooms if offset by a free afternoon tea, canapes and the provision of drinks. The breakfast buffet is particularly good, with the eggs benedict highly recommended. Brilliant amenities available for guests, including free Wi-Fi, a gym and a swimming pool.", "This is a great hotel with extras not usually found in Singapore and is perfect for business or pleasure. This hotel isn't centralized to the city are others but is within walking distance of the shopping area and only a short taxi ride away from other areas of interest. Excellent rooms that are spacious and luxurious, and for a great price. The cleanliness is very good and they provide amenities, as well as welcoming tea and fruit, in all rooms. The taxi-hailer was a nice touch. Champagne in the lobby while you wait! And the buffet breakfast was brilliant. There is a huge choice and fresh food with rave reviews for the Eggs Benedict. There is also free afternoon tea and canapes on offer. There are nice touches here at the hotel such as a changing carpet to reflect the day of the week in the hotel or the great WiFi connection that was free throughout the whole hotel. It even has a gym and swimming pool for guests to enjoy."], "common_summary": ["The staff at the hotel were very friendly to guests.", "The staff are extremely friendly and provided excellent service.", "The staff at this hotel is very friendly and helpful."], "entity_a_uid": ["UR120835484", "UR55114463", "UR50200272", "UR19909473", "UR54654429", "UR118040059", "UR128358071", "UR91209828"], "entity_b_uid": ["UR118227500", "UR19379138", "UR120951290", "UR20351597", "UR121615013", "UR122599440", "UR121684482", "UR10191907"]}, {"entity_a": "183586", "entity_b": "155495", "entity_a_summary": ["This hotel gives a mix of luxury and odd unsafe feeling. The location was fine. It is on the outskirts of downtown and close to everything you need: it is steps away from Eaton Centre, Yonge Street, and great shopping areas. However, the blocks surrounding it aren't ideal. The hotel staff pleasantly provided lots of great local recommendations. The food here is okay including the hot and cold options for breakfast buffet. It is worth checking restaurants across the road as well. This hotel provides so many amazing additions, such as a nice swimming pool with hot tubs and locker room facilities, a beautiful roof top space with plenty of seating, and complementary internet access. The only downside is the expensive underground parking.", "The Grand Hotel provides a good stay for your time in Toronto and a good hotel to use again on repeated visits. With only a short walk to the Eaton Centre and Yonge Street for shopping and restaurants, the hotel's location is convenient though not in the nicest area. Even so, the feeling of safety is present despite what other reviews have said. The staff offered lots of tips for getting around and were very friendly and knowledgeable. The food is okay and offers both hot and cold options but breakfast was disappointing with watery scrambled eggs, dry bacon, and an extra charge for a cappuccino. Although underground parking is $19.00 per night the complimentary internet access helps take away the sting of the expense.", "The Grand Hotel is great and staying again is certainly worth considering. Easy trips to Toronto and overall satisfaction of the hotel. The hotel is perfectly located for those touring Toronto. Close to the Eaton Centre and Yonge Street, as well as the general shopping areas of town. A generally safe area and a free shuttle is provided for travel to other tourist areas. too. The staff were incredibly helpful and knowledgeable about the local area too. Very accommodating. The hotel provides a buffet breakfast, both hot and cold. The quality is adequate for the price . The hotel has underground parking, which can be expensive if charged. The hotel has a scenic rooftop area with lots of seating available. "], "entity_b_summary": ["The hotel is really grand and gave a very royal vibe, and even treats you like royalty too. The room was fairly small and a little dirty in places but it featured large comfortable beds and a good flat-screen television. Overall it's a great hotel but it has one big flaw and that is you have to pay quite a bit of money just for internet access. This is unfortunately typical of most expensive hotels.", "The hotel had lots of atmosphere and made guests feel special. Good location near the Toronto tourist spots. The rooms in the hotel are quite small but adequate. Some of the rooms are dark and a little dirty, with antiquated furniture too. The restaurants have some really nice food here at the hotel. One thing to note about the hotel is that you need to pay for access to internet services.", "Beautiful historic hotel well worth visiting. It's of a large size with a grand lobby and there is a very charming atmosphere about the building. This location is great for all the best tourist hot-spots and sight-seeing in the city. The rooms were small and dark with dark furniture but the bed was comfortable and the furniture was modern. The restaurants in general are brilliant and the breakfast served is an excellent quality. Internet access is $16 from the hotel."], "common_summary": ["The front desk staff of the hotel were helpful and the rooms are comfortable.", "The staff were very helpful and attentive too. The rooms were fine and clean as well as very comfortable.", "The staff was very friendly and the rooms were clean."], "entity_a_uid": ["UR39057599", "UR118020136", "UR35088458", "UR5531878", "UR38046854", "UR5707848", "UR11932903", "UR83409481"], "entity_b_uid": ["UR71283186", "UR5363578", "UR124155078", "UR18687883", "UR119562778", "UR116757978", "UR117402474", "UR121285439"]}, {"entity_a": "111486", "entity_b": "87617", "entity_a_summary": ["The hotel was attractive and clean. The hotel is situated next to the train station but also next to the fire department which can make it noisy. There are lots of bars nearby. The hotel rooms are clean and comfortable, although perhaps in need of a slight touch up and redecoration. The room had good disabled access, including the bath. The hotel provides a free breakfast buffet in the morning, as well as free hot drinks all day, which is popular with families staying. The hotel is also close to Rock Bottom Brewery, which serves really good food. The hotel can provide early check-in instead of waiting later, which was a nice gesture.", "This hotel is of good quality and offers a pleasant night's stay for guests with its comfortable ambience and the high levels of cleanliness. The location is terrific other than the sometimes noisy fire station situated next door, but that can be overlooked because there are good bars located nearby and it's only a short walk to the train station. Whilst the hotel room might have benefited from a remodelling it was still really clean and overall fine. Accessible rooms are well-considered, too. The complementary free breakfast buffet is a must and is really popular. The items available are really tasty and you can access free coffee and tea whenever you need. The hotel was accommodating and allowed check-ins from 9am.", "This is a pleasant and attractive hotel and overall provides a good stay. This is in a brilliant location, with local bars on very close proximity. Public transport links are just a small walk away, and that allows you to venture out further for sight seeing. The rooms at this hotel are very clean and comfortable but are in need of updating or remodeling. They do have accessible rooms and bathrooms to accommodate for wheelchair access too. This hotel provides free breakfast from 6AM to 10AM at the breakfast bar which families love. Coffee and tea are free 24 hours a day but there are great tasting local beers available too. Not far away is the Rock Bottom Brewery for burgers, carrot cake, and of course beer. The hotel did allow an early check-in at about 9 AM."], "entity_b_summary": ["This hotel is great and couldn't be better, therefore it is definitely recommended especially to other travellers heading to Chicago. The location of this hotel is unbeatable because it is just off of the river. There is an easy walk to experience downtown as well so that's a great bonus to this well-located hotel. The rooms were spacious but quite dusty and hot. The beds were adequate and the bathrooms were amazing. Some of the cleaning staff did miss an area that should have been cleaned. Unbelievably it was quite expensive just for a canned soft-drink from the minibar in this hotel room. The only available parking at the hotel is valet which can be costly. The use of internet is costly too.", "In general the Hyatt hotel is highly recommended, but it can have a busy atmosphere, be a little noisy and a little expensive. The hotel is located closely to the river, and just a short walk to Michigan Avenue, Grant Park and Navy Pier. The room was really hot and also quite dusty, and the bed wasn't great. Cans of soft drink from the hotel mini bar were expensive at $4 each. The price of the hotel makes it a really good choice especially with the view overlooking the river.", "This recently remodelled Hyatt has very nice amenities but might be too dark and shabby for some and can be noisy when busy but is okay. The location of the hotel is great for convenience. Close to downtown and overlooking the river for some really good views. The rooms at this hotel are rather average. They are quite spacious with very comfortable beds. However, the cleanliness is not quite up to scratch and the rooms get very hot. The soft drink from the minibar was expensive. The cost of this hotel is average, however the valet parking is expensive and unfortunately is the only option whilst staying at this hotel."], "common_summary": ["The staff were helpful and would definitely stay at the hotel again.", "The staff here at the hotel will do all they can to provide a helpful and friendly service. Owing to this as well as the great location of the hotel makes it very easy to return.", "The location of the hotel is great and close to Michigan Avenue and the staff are friendly and helpful."], "entity_a_uid": ["UR66348855", "UR111840297", "UR112593623", "UR16153338", "UR117886875", "UR33937021", "UR13924399", "UR55272244"], "entity_b_uid": ["UR117767367", "UR60100404", "UR80093507", "UR3212537", "UR5205961", "UR117841638", "UR125183952", "UR122010349"]}, {"entity_a": "94337", "entity_b": "111441", "entity_a_summary": ["The hotel has all the modern conveniences but is set out in a classical style. It's super easy to access the city centre from this hotel, making it a great hotel for location. At this hotel some rooms are very elegant and quiet with comfortable beds and even a fireplace. The shower was great, too, but the walls are really thin. The hotel even provides car service. The hotel provided some great food and every dish tasted great. Unfortunately the taps on the sinks were pretty tight and because it is an older building there seemed to be no soundproofing.", "This is a superb elegant but modern hotel that truly deserves its high-star rating. It is a little pricey however well-worth it because it exceeds all expectations. The hotel has easy travel into the city centre as as well as in walking distance to all the major sights you may wish to see. The rooms were elegant with a fireplace and comfortable beds. However the walls were quite thin. The staff were attentive and accommodating to all needs, even as far as the hotel car service etc. The range of foods provided by the hotel were excellent. One thing to note about the hotel is that the sink taps were on too tight to use properly.", "A lovely hotel that exceeds expectation, it thoroughly deserves the high rating and worth the price. Very elegant with modern, luxurious amenities to please guests. The location of this hotel is great for those wanting to get to the city centre, and all the amenities are in walking distance from the hotel which is very convenient. Beautiful rooms at this hotel, with a cosy fireplace for guests to enjoy. Very elegant whilst also providing guests with a comfortable bed. The food was simply amazing. Due to this hotel being an older build, there have been some issues with the air conditioning and the sink taps can be very tight. Not only this, but it is very easy to hear background noise as nothing seems soundproof."], "entity_b_summary": ["This is a great and beautiful place to stay for business or for pleasure. All experiences here have always been fabulous and convenient. The hotel is close to the theatre district with restaurants close by. It is situated close to Macy's, TJ Maxx and other shopping centres and the subway for easy travel. Rooms in this hotel are really nice and can't be recommended enough. The hotel only had one restaurant and a small bar, so the choices were limited. There is a free breakfast provided, but it is not advertised clearly. There is a charge to use the WiFi at the hotel and the fitness centre was not great.", "The hotel is a convenient place to stay, whether business or pleasure. The hotel is beautiful and clean and is ideal for repeat stays. The hotel's location is really good because there are shopping destinations and theatres nearby. In addition there is a subway station that isn't too far away. The rooms of the hotel are perfectly adequate, in particular the bathroom and linen. Extremely friendly and helpful at all times. There is a complimentary breakfast here, which you may not be informed about when arriving. It would have been good to have had more food options in the one restaurant the hotel has here. Like many hotels, there is a charge to use the Wi-Fi here, however there is a fitness centre facility on site for guests to use if they so wish.", "This hotel is great for business or pleasure and will be frequented over and over by its visitors. It is clean and beautiful and very convenient. This hotel is not only close to the theatre district but to shopping at Macy's, TJ Maxx and Marshall's. There are close by restaurants to choose from but also the subway station isn't far away for those wanting to go further on. The rooms are nice. The restaurant and small bar lacked availability of food options for guests, however they do serve a complimentary breakfast. There was a disappointing downside to this hotel in that you have to pay for WiFi access. There is a fitness centre but that is a little so-so."], "common_summary": ["The rooms of the hotel were clean and it is located perfectly for Boston.", "Whilst located in a great place for Boston, the hotel rooms are lovey and clean and the room-service provided is second to none.", "The rooms were very clean and the service excellent."], "entity_a_uid": ["UR30660882", "UR3913189", "UR78951640", "UR6596107", "UR120547844", "UR80068933", "UR120924744", "UR3609969"], "entity_b_uid": ["UR2575337", "UR25481902", "UR122294837", "UR7948372", "UR84495886", "UR121611259", "UR33094780", "UR125068971"]}, {"entity_a": "229677", "entity_b": "1223953", "entity_a_summary": ["This is overall a really great hotel but a bit pricey. It could be quite disturbing if you stay on the front of the hotel due to the horns from the street. The location of this hotel is absolutely great and central, you can walk to many shops, Gaudi 's Casa Batllo , and la Pedrera. The metro station is also really close. A standard room at this hotel is smaller than expected, with most of the space being taken by the huge but very comfortable bed inside. The bathrooms was outdated and need some updating. The room service was overpriced. Unfortunately the hotel's breakfast definitely not worth the money. The lifts were a bit inconvenient and request long time wait because there are only two of small and infrequent ones. Also, the rooms facing courtyard at the back are quieter than the ones to the front.", "This hotel may be the place you want to stay with each visit to Barcelona. It's not cheap but it is lovely. It's also popular with business travellers but the Spanish do like to beep their horns so staying at the front of the hotel could be noisy and disturbing and leave you disappointed. Being within close proximity of the metro line and only a short walk from Gaudi's Casa Batllo, la Pedrera, and even not far from Sagrada Familia, the location of this hotel is great. It is very centralised with many shops nearby as well. Overall, a fantastic location. The hotel rooms are an adequate size with a decent night's sleep to be had from the bed itself. The bathrooms are a little outdated and could do with a deep clean. The staff at the hotel were incredibly helpful. The hotel had a lovely pillow menu but breakfast was not worth the price paid. The front of the hotel can be loud so it is worth requesting a room facing the courtyard at the back and you may want to consider one of the lower floors to avoid having to take one of the two lifts. They are small and irregular in their arrival causing sometimes long wait times.", "The hotel, although a tad expensive, is a good option for a short stay in Barcelona. The front of the hotel can be noisy at time so ask for a room that is not facing the street. The hotel is situated near a metro line to get into central Barcelona. The hotel itself is a short walk from Gaudi's Casa Batllo, la Pedrera and just a little further to see La Sagrada Familia. The rooms are okay though on the small side at times. Bathrooms needed updating and some TLC but overall the rooms are good value due to the hotel's location. The hotel's staff was really very helpful. The hotel's breakfast was a bit basic and expensive for a 4 star hotel . The lifts in the hotel are a bit cramped and can take some time to arrive. The best rooms in the hotel are the ones facing the courtyard at the back, as the front side of the hotel can be noisy."], "entity_b_summary": ["Whilst it's ideally located for shopping and dining, and there is a beach and subway station nearby, it's quite far from the true local character. The room was spacious but was not as advertised online. The room was cleaned but there was a lingering smell and drug paraphernalia left there. The hotel staff were polite and accommodating. Even one of the porters managed to show us how to work all of the mod cons of the room as well. The breakfast was okay enough but the coffee from a machine was quite unpleasant. There is free WiFi here at the hotel and a great gym . The pool looks a bit different than pictures provided online and was on the smaller side therefore crowded. Overall though it is worth the money charged.", "This hotel provides a really impressive stay. The hotel is located within ten minutes walk from the beach and around five minutes away from a shopping mall and restaurants. The hotel is a little expensive for the location as it is not in the centre of Barcelona. The rooms are very unsatisfactory for the most part. Some are spacious but views are less than great, the room smelled of cigarettes and the representation of the rooms online was not accurate. The staff were polite and helpful but also really friendly and approachable when requiring help with any issues. The breakfast was okay but not much selection. The hotel's pool can be a bit crowded at times but the gym facilities are excellent.", "A very pleasant hotel to stay at, especially if visiting on business for a conference as many are held here. The location is convenient for the tram and subway but far from the character areas of Barcelona. But shopping and dining is close by and there is a beach within a 10-minute walk away. Average rooms at this hotel, that are spacious and reasonably comfortable. However, it noticeably smelt of cigarette smoke which wouldn't disappear, and the supposed sea views are quite poor. The staff at the hotel were all very helpful and friendly. breakfast was notable only in that it was monotonous and the coffee was from a machine. This hotel offers free WiFi as long as you check into their Facebook page each time you sign on. Also, there is a charge for towels at the pool but not a lot of room to sit. The hotel does have a good gym though."], "common_summary": ["The location of the hotel is near to the city centre.", "The hotel is located in a useful area to reach the central sights.", "The location of the hotel is great and is within a metro ride or walking distance to the sights."], "entity_a_uid": ["UR128240473", "UR94932417", "UR120955075", "UR121601393", "UR127245148", "UR66840138", "UR105074545", "UR91075304"], "entity_b_uid": ["UR111735697", "UR127057538", "UR115709757", "UR116711057", "UR76417811", "UR124244915", "UR124910050", "UR118352118"]}, {"entity_a": "225097", "entity_b": "1176623", "entity_a_summary": ["The hotel had a spa and pools that made it a relaxing time during the stay. The hotel was clean and there were also figures made of ice to see. The hotel is ideally located to explore local restaurants and bars in the area. The room was large and featured a flat-screen high-definition television. The hotel room was always very clean and toiletries were always provided upon asking. The price of the food is quite off-putting and they could improve what they offer. Despite being fairly pricey there were really stunning atria with various wildlife to see.", "A few days isn't enough at this hotel because it's so relaxing, clean, and there is a spa and multiple pools to explore. The rooms in the Emerald Bay section of the hotel were very clean and all items were well stocked in the room. The bedrooms are large too and some overlook a courtyard separated by a glass covered interior. The hotel's food can be a little on the expensive side and the quality could have been greater. The hotel had picturesque atriums with alligators, various fish and other species.", "This is a very clean resort with restaurants, a spa and pools to enjoy and relax with over a few days or even a week. It even offered a display of ice figures. The rooms each have a refrigerator and are very clean and even overlook an interior glass-covered courtyard but not out beyond the hotel. The rooms have a large bedroom and living room area with flat-screen HD TV. The food at this hotel is particularly expensive, especially for the quality that they are providing. The hotel's prices for a room are quite expensive than other hotels in the area. However, it does seem that you get what you pay for with this hotel. There are also lovely features in the hotel, including a beautiful atrium with fish and alligators in."], "entity_b_summary": ["There were no issues at this hotel and would recommend it to anyone. The hotel is situated in a great location only 10 minutes from Disney and 20 minutes from Universal Studios and Seaworld. The hotel is also close to a selection of restaurants. The rooms of the hotel are comfortable and affordable, but not big enough for more than two people. The air conditioning works well but the rooms can be unclean.The bar at the hotel is really reasonable and serves a really good Long Island iced tea. There is a lot of misrepresentation between the website and reality because the price in person ended up being more expensive than booking online, and the barbecue and lagoon areas were really not up to standard.", "This hotel is recommended and a trouble free place to stay. The location here is excellent and big attractions are a maximum of 20 minutes away. The rooms are quite small if more than two people stay here and the carpets weren't clean at all. Additionally to that there were bugs in the fridge and throughout the room. There was air-conditioning and a television in this room and that does make the stay a bit more welcoming. The drinks prices were acceptable and the Long Island Iced Tea was satisfactory. The pictures on the website were not an accurate representation of the hotel . The bbq and the lagoon are both below acceptable standards.", "The hotel is cheap but adequate for a short stay or long stay. This hotel is ideally located for some of the main tourist attractions such as Disney and Universal, which is very convenient. It is also perfectly central to some of the big chain restaurants, which is perfect after a busy day sightseeing in a busy area. The rooms are too small and there are bugs in the refrigerator and the carpets need a good clean. The positives were that both the TV and the aircon worked fine and there was plenty of parking. The BBQ and lagoon are represented differently, in a much more positive way in the pictures than what they actually are."], "common_summary": ["Would recommend the hotel. The staff of the hotel were very helpful.", "The service provided by the friendly staff here was really excellent. Overall a very recommended hotel.", "The service of the hotel was excellent. The staff is great. This hotel is highly recommended."], "entity_a_uid": ["UR115175146", "UR7473897", "UR126701184", "UR48092816", "UR68366075", "UR122944984", "UR3475513", "UR121712423"], "entity_b_uid": ["UR62992130", "UR119395683", "UR106362633", "UR128066438", "UR119185796", "UR48947134", "UR99983599", "UR126649423"]}], "dev": [{"entity_a": "254461", "entity_b": "185747", "entity_a_summary": ["The hotel has conference rooms available to rent out for conferences and corporate events. The location of this hotel makes it easy to access restaurants, the river and shops. The rooms are a good size and well decorated. The bathroom in the hotel was large and with a large bathtub. Small touches like a chocolate on the pillow are also nice. The hotel has a roof terrace for drinks. Unfortunately the hotel is missing the availability of a pool.", "This is a lovely place that was wonderful in all ways. It is definitely a place you will want to return again. The hotel is in walking condition to local restaurants, bars and even the Mont Royal. Beautifully decorated hotel rooms that are well designed and comfortable for all occasions. Very spacious in size with luxurious amenities in the bathroom, and it's the little touches such as chocolates on the pillow that make these rooms even more memorable. The hotel features some good places to have drinks and food, and there were even great chocolates left on the pillow. This hotel could do with a pool as that is the only thing it is really lacking.", "The hotel, Le Place D'Armes, is amazing. It is elegant. The rooms are very nice and upgrades are available. This is a great place to stay on business as well. The hotel is within easy walking distance to restaurants, bars, and shopping. You can also walk to the Mont Royal or the river. Fantastic location. The rooms are nice and spacious with good decoration too. The bathrooms are really great because there are massive bathtubs and lovely rainfall showers. A nice touch is the turn-down service with cute chocolates left on the pillows. The staff at Le Place D'Armes is great. Really good service overall. The two restaurants at this hotel are highly recommended, and there is also the option to eat and have a few drinks on the roof terrace to enjoy the views. "], "entity_b_summary": ["The hotel is especially memorable during a winter stay. The room was okay but on the small side including the bathroom as well. After upgrading rooms to a suite this was absolutely fine and had a great view with modern decor. Whilst the breakfast and dinners are both quite expensive they're really great and tasty. But a coffee maker and coffee was not free of charge, which is unusual. Whilst the toiletries were really great there was an issue with the toilet.", "This is neither a disappointing hotel or one that will exceed expectations. It can be magical in the winter time and it is definitely a nice hotel, it just won't blow you away. A very convenient location. The bathrooms in the hotel room are quite small but the room itself is clean and modern . The hotel serves very good food at both breakfast and dinner. It is a little expensive but you definitely get what you pay for. The hotel uses Miller Harris citron toiletries which is a nice touch.", "This is a generally good hotel that is slightly expensive but highly recommended for a memorable visit to the area. It is also in close proximity to the city centre, so a lovely place to go for nice walks. This hotel is located in a really convenient area here. The rooms at this hotel are smaller than expected and the toilets are inadequately sized and too small for comfortable use. An upgrade might be an option to consider though as the suites are very nice. The quality of the breakfasts and dinners at this hotel are great. However, they are quite expensive and the coffee in the rooms don't come free as charge like most other hotels."], "common_summary": ["The staff at the hotel were incredibly accommodating and the hotel was well located.", "At this hotel you will find the staff are really accommodating and friendly. The hotel is also a well-located place to stay in Montreal with some great things to do nearby.", "The staff at the hotel are friendly and helpful and the beds are great."], "entity_a_uid": ["UR116213406", "UR125621536", "UR119801869", "UR64866156", "UR108457071", "UR23919613", "UR4736328", "UR85589113"], "entity_b_uid": ["UR119964745", "UR94330536", "UR96905140", "UR52258443", "UR117656941", "UR89862189", "UR116518066", "UR118511479"]}, {"entity_a": "647813", "entity_b": "186946", "entity_a_summary": ["This is a hotel located in an excellent place. It is perfect to walk to the entertainment district as well as pubs and restaurants. Rooms on the higher floors are excellent as they can provide a great view. The room itself is of a lovely quality and even had a full kitchen, which is incredibly useful. The hotel's complimentary breakfast was really good.", "This is a great hotel to visit and you will look forward to coming back again and again. The hotel is situated near lots of pubs and restaurants. The hotel room was on a high floor so there was a great view of the CN Tower. The room also had a full kitchen which was ideal. The morning breakfast was complimentary and served really great superb food.", "The Residence Inn at Toronto is great and staying often is something worth considering. This hotel is close to nightclubs, the entertainment district, restaurants and pubs. Some rooms on the higher floors of the hotel can boast of lovely views, but other options are rooms with full kitchens to prepare your own food if you prefer. The complimentary breakfast was really great."], "entity_b_summary": ["This hotel is great and pretty amazing, and you would definitely want to return. The hotel is located close to the CN Tower, the hockey Hall of Fame and the Rogers Centre for example. The deluxe room was quite small and didn't have a view at all, but it was pretty clean. There was a lot of noise that could be heard from the room, as well. The hotel's breakfast is in included in the room's price, but a little expensive.", "The hotel treated first time stayers with respect. The location of the hotel couldn't be better because there are nearby attractions, night-clubs, and popular sights within walking distance. Even the deluxe rooms in the hotel are not to be recommended. The rooms are small with poor storage. The showers are lukewarm and the hall is noisy with rowdy guests at all hours. Unfortunately the buffet breakfast didn't come cheaply but it the food was mostly fine.", "A highly recommended hotel that provides excellent customer service. This hotel is close to most of the major attractions in the area, with many of them being walking distance from the train station. The Delux room was not very impressive but was comfortable and clean despite being small. Cupboard space was also lacking and it was lacking much hot water in the shower. The hotel is considerable small, with limited room available for guests to move around and use some of the facilities with ease."], "common_summary": ["The staff have been okay at this hotel and sometimes were great and helpful but at times they wouldn't treat guests incredibly well. The hotel is also located near to CN Tower.", "While some staff are always so helpful at this hotel, others were not great at fixing any issues that arose. The location is great for visiting the CN Tower, too.", "Location was within walking distance to the CN Tower, the rooms are clean. Some of the staff were so courteous and helpful and super friendly, while others were very unhelpful towards their guests."], "entity_a_uid": ["UR120048007", "UR10271843", "UR65523511", "UR10056626", "UR115751733", "UR37920427", "UR39940747", "UR37523896"], "entity_b_uid": ["UR2583936", "UR32452900", "UR123988096", "UR48922820", "UR7827723", "UR3777043", "UR25702851", "UR7417986"]}, {"entity_a": "302130", "entity_b": "302173", "entity_a_summary": ["The hotel has a level of homely comfort, but sometimes lack small personal touches, The hotel is connected to a subway and sits above the Pacific Place shopping mall., however it can take a while to travel to the business district. The rooms are really modern but unfortunately lacking in style and space. The hotel has a cafe that provides lunch but it was really expensive and equally as disappointing, however you can get drinks from the bar that's in the foyer. The hotel had good facilities available, such as a gym and a pool.", "This is a really great hotel, however, it lacks the personal touch. The location is great because not only is it connected via a big shopping mall but it is super easy to get to the subway station. The views aren't so great because really all you see are skyscrapers. The rooms of the hotel were modern and close to the elevator, but they were also on the smaller side and a little simplistic. The food at the hotel is very expensive and not enjoyable. The breakfast was nicer than the lunch. The hotel has very good exercise facilities such a good gym and a nice pool.", "A well recommended hotel, that is a particularly pleasant experience to visit. Very comfortable to stay in, however there are no unique touches that makes it personal and stand out from other hotels in the area. The location is okay as is near the subway and is atop the Pacific Place Mall, so shopping is very convenient. The recently renovated rooms are decorated to have a modern twist. However, even by Hong Kong and Tokyo standards, they are considerably smaller than other hotels. The cafe can be quite expensive in this hotel at any time of day, however the food is much better for breakfast than it is for lunch. Excellent facilities at this hotel to keep guests busy and entertained."], "entity_b_summary": ["Despite being interconnected to the airport this is a very quiet hotel that was actually awarded for being the best airport hotel. It is a fantastic hotel overall and you will probably wish to return to it. This hotel is ideally located for those who are flying as it is close to the airport and makes it superb for early flight visitors. The rooms in the hotel are large and spacious , but some of the electrical items in the room were not functioning. The buffet breakfast was great. The luggage was dealt with really well and the check-in experience was super efficient.", "The Regal is the best airport hotel and still remains quiet despite the air travel. The hotel is the closest available to Hong Kong's airport and also a great hub to be able to get out and about the city. The hotel provides a free shuttle service to the local out let mall Tung Chung and other shopping centres in downtown Hong Kong. Whilst sleeping is really good here in the hotel's rooms, it did not feel like value for money and a lot of things in the room were not working at first. T The cafe provide buffet breakfast on the ground floor which is really good. One thing to mention about the hotel is that the luggage arrived and was checked in very efficiently.", "A lovely place to stay, with direct links to the airport. Excellent luxury amenities on site, including a swimming pool and gym for the guests to use when they please. The hotel is located near the airport but convenient for short visits to HK. The rooms are inconsistent. Some are great in that they are large and comfortable while others are disappointing because of non-working equipment in the rooms. The cafe on the lower ground floor of the hotel provides a very good buffet style breakfast for guests. Check-in was quick."], "common_summary": ["The rooms at the hotel were clean and spacious and the hotel staff were great.", "The rooms here are clean as well as spacious and the staff are really excellent too.", "The rooms are clean and spacious and the staff are very helpful."], "entity_a_uid": ["UR396019882", "UR757818446", "UR910258668", "UR608758353", "UR327869871", "UR926273542", "UR576115828", "UR722715066"], "entity_b_uid": ["UR128083213", "UR4351624", "UR129700604", "UR122170988", "UR29051644", "UR131385721", "UR126213484", "UR135121861"]}, {"entity_a": "155846", "entity_b": "1108305", "entity_a_summary": ["The hotel was clean and reasonably priced. The hotel does need a makeover and would improve if some of the charges were lowered. This hotel is located in a really great area with a really handy walk to the shopping area and restaurants, as well as a convention centre nearby. The rooms are spacious and flawlessly clean with everything available that you could possibly need. The bed was unbelievably comfortable and provide a great night's sleep. The hotel is a little bit outdated and in need of a bit of an upgrade though. The hotel had an expensive breakfast however overall the food is great. The pool at the hotel is open for a good amount of time for guests. There is also parking available which is a bit expensive, but the hotel can help out with it.", "The price of this hotel is okay but it feels somewhat dated and needs an overall makeover. That said, the place is clean. The hotel is situated close to the Vancouver Convention Centre and 10 minutes from Canada Place where you can catch a cruise ship. The rooms of the hotel were very nice and spacious, with stunning views of the surrounding area. The morning pastries and buffet was pretty good here at the hotel. There was a great pool to use for hours, which is great. There is a deal to help out with the somewhat pricey parking, too, if you're thinking of using a car here.", "This reasonably priced hotel may be older and may need a makeover but the restaurant is great and it does have beautiful suites. Some of the charges could stand to be dropped to improve the hotel experience but it is not disappointing here. Perfect location as it is walking distance to all amenities and major attractions in the area. The rooms at this hotel are very clean and the beds in particular are very comfortable; perfect for a good night's sleep. They are also spacious and fully equipped for your stay, making the visit relaxed and stress-free, however they are in need of an upgrade. The food at this hotel is delicious, and is particularly pricey if you choose to eat in the restaurant as opposed to the buffet style breakfast on offer. Great facilities on site at this hotel, and although the parking can be quite expensive, a deal is usually provided to help with the cost."], "entity_b_summary": ["You will want to come back again and again to this hotel because it exceeds any other hotels in the city. The staff have a professional attitude, although due to it being a new venue some of the staff need a bit more time to develop. However, we were provided a complimentary round of drinks by staff due to this. The hotel provides a good breakfast and also an afternoon hor d'oeuvres buffet. The staff also provided a complimentary round of drinks by way of an apology. The hotel was a very good price and exceeded expectations set out by the website.", "This hotel is the best in Vancouver. This hotel provides really good access to main attractions that are nearby. This hotel has lovely large rooms that felt very luxurious. The housekeeping staff who were all excellent. It seemed like some wrinkles were still being ironed out because this is still a new hotel but check-in and check-out were smooth and easy. This hotel provides a really nice breakfast as well as an afternoon buffet that's included in the price, so it's definitely recommended to take advantage of this. The pricing compared to other hotels makes this a really reasonable hotel.", "This hotel is of average quality, but worth the visit. This hotel is central to some of the major attractions in this area. The rooms here are large and very comfortable. The hotel is relatively new and the housekeeping team was friendly and helpful and everyone had a great attitude. The hotel offers a nice breakfast and buffet inclusive in the costs, a lovely guest lounge to enjoy drinks and nearby restaurants. A very well priced hotel in comparison to others in this area. It is even better to look at in person than on it's website."], "common_summary": ["The hotel is highly recommended. It is in a great location and the staff at the hotel are very amiable and helpful to guests' needs.", "This hotel cannot be recommended highly enough because the location is so great and close to everything downtown. Not only this but the hotel staff were friendly and so helpful when catering to every need.", "This hotel is in a great downtown location and it is highly recommended. The staff are friendly and helpful."], "entity_a_uid": ["UR122853460", "UR125144526", "UR110953324", "UR121164376", "UR118007264", "UR117286776", "UR124891387", "UR71870551"], "entity_b_uid": ["UR117852302", "UR121884674", "UR118045708", "UR68413773", "UR117531930", "UR128198460", "UR103649407", "UR19449783"]}, {"entity_a": "224665", "entity_b": "185718", "entity_a_summary": ["This greatly loved hotel is well kept and comfortable. Everything you could need in terms of shops and restaurants are really close to this hotel making it superbly located. Additionally there are plenty of attractions such as a theatre and cathedral just around the corner. The view from the luxurious room was really nice overlooking the courtyard when it was sunny. Additionally rooms can accommodate four people while still being comfortable and really clean. The doorman was always at the entrance of the hotel to greet guests and the great staff were very welcoming. There was a buffet for breakfast and it provided great-tasting food. Additionally there is a great outdoor dining area that was well-suited for eating lunch. There were some really great toiletries available at this hotel. The price was really reasonable as well considering how comfortable and elegant the hotel is.", "Excellent hotel that is highly recommended in this area. It's very clean and a comfortable place to stay. The hotel is in a great location only a ten minute walk from the metro station and near to the cathedral and the river. The cultural centre is a short taxi ride away. The rooms were large and luxurious, perfectly able to house four guests as requested. The room was comfortable and clean. Rooms on the first floor have access to a lovely courtyard garden. The hotel has a lovely outdoor dining area for lunch. The meals served at the restaurants are a good quality too. The hotel had lovely toiletries available and there was free Wi-Fi available.", "This hotel provides a clean and comfortable hotel and it will soon become your favourite. Centrally located, this hotel is close to grocery stores, restaurants, liquor stores, and next to Notre Dame Cathedral right at the center of the Old Quarter. The Metro is only about a 10-minute walk away or a quick taxi to the cultural center for some ballet or music. This hotel has luxurious, comfortable and clean rooms. The breakfast was amazing. Free WiFi and excellent bath products were included."], "entity_b_summary": ["A good quality hotel that provides a nice and enjoyable stay that will not break the bank. The bathtub in the room took too long to drain and there is only the facility for one computer to have access to the internet per room. The hotel's breakfast selection was really good, as well as the selection provided at the bar. Rooms on the executive floor are provided with a complimentary breakfast, as well as appetisers and snacks for a nominal fee.", "The hotel is a well managed business and is a cost effective stay. This hotel is located downtown which is a great location to be. It's easily accessible to lots of fancy restaurants, shopping and even movie theatres. Unfortunately a downgraded room was disappointing and there is wired internet for only one computer per room. The breakfast is absolutely delicious with a great selection of food at the bar. Breakfast can be complimentary if booking a room on the executive floor and the evening appetisers only cost a small fee. Average hotel, and there is limited Wi-Fi available.", "The Bonaventure Hotel provides a lot for the cost and is wonderful. This hotel's location is great as it is in central downtown and close to the Bell Center and connected to the underground city for shopping and entertainment. Rooms are close to a private pool, with there being a pool for each wing of the hotel, and guests have private access to the beautiful landscaping that surrounds their rooms. This hotel includes an executive floor to book, where breakfast is complimentary or in the evening appetizers and snacks are at a minimal cost. The breakfast is very good too and they have a lot on offer at the bar as well. There is only wireless internet available in the lobby but everything else about the hotel is fine enough."], "common_summary": ["The staff at this highly recommended Montreal hotel were friendly, warm and so helpful. The hotel is also close to sights, restaurants and shopping.", "The hotel is definitely recommended and the front of house staff were particularly amiable and helpful.", "The hotel is highly recommended. The location is great and the staff is very helpful."], "entity_a_uid": ["UR52212041", "UR120285646", "UR123353746", "UR47348625", "UR76052356", "UR85588559", "UR36762422", "UR123280623"], "entity_b_uid": ["UR120297160", "UR73762744", "UR17761356", "UR125912634", "UR88198341", "UR6134184", "UR7579758", "UR111651352"]}, {"entity_a": "586662", "entity_b": "232321", "entity_a_summary": ["The hotel is great and provides a safe place to stay. It is a favourite with guests. The hotel is close to the metro line and Rembrandt Square and away from the louder tourist areas. The room was quite small at this hotel but it was quite modern and clean. Everything was wheelchair-accessible which was fantastic, even if there was no shower curtain and it left the bathroom floor somewhat wet. The staff at the front desk were unhelpful to guests. The hotel provides a fantastic selection of food in their seafood bistro. The WiFi in the hotel lobby is very slow. The carpet was dirty and the exterior of the hotel is noisy and overcrowded.", "This is a recommendable and respectable hotel for a great time whether you're travelling alone, with a partner, or with the family. The hotel is situated in a perfect location and is very accessible via the metro station that is only five minutes away. Adding to the great location is the fact that there are plenty of entertainment options very close-by. The rooms in the hotel were modern and well appointed. Both the room and the bathroom were easily accessible for wheelchair users too. Some of the staff was really rude. There is a great seafood bistro at the hotel. The hotel's carpets are absolutely filthy and the surroundings do not help with this vibe - it was crowded and noisy and after it rains the street is really disgusting.", "A great hotel to stay at, it is central to the city centre of Amsterdam, yet still at a very reasonable price. With the hotel being only five minutes from the metro station access to travel and entertainment near Rembrandt Square or you can simply walk to most places. The rooms are very nice with great bathrooms. and the beds are so comfortable. Some rooms are on the small side and some are wheelchair friendly. Particularly rude member of staff on the reception desk that is very unhelpful. This hotel has a great seafood bistro restauraunt. Although there is Wi-Fi available at this hotel, it can be very slow and the staff aren't the most efficient at helping guests log in. The hotel is also quite dirty, particularly the carpets, and it can get very noisy and crowded in places."], "entity_b_summary": ["The stay at the hotel was quite expensive, but absolutely worth the cost. No complaints. The view from the room was great because it overlooked the canal. The wireless internet in the room was free, which is really useful. Even better though is that the rooms are luxurious and decorated to a lovely standard. All of the staff were lovely because they were friendly but professional at the same time. They were clearly very knowledgeable, which was just wonderful. The hotel provided free internet services and also the use of a printer too if needed.", "This hotel is a little bit pricey however it is well worth it and there is nothing at all to complain about. The location is ideal for those wanting to sight see, as everything is in walking distance from the hotel. The room in the hotel was very spacious and was overlooking the canal. Free wireless internet is also provided for guests. The staff were amiable and very professional, with a number of them able to speak different languages. The hotel offers free internet and also a printer if required.", "Although it is quite an expensive hotel, it is great value for money as it is of high quality and makes for a really comfortable stay. For ease of sightseeing this hotel's location is perfect. All within walking distances are the Dam, museums, the Begjinhot, restaurants and bars and the Red Light District. The room was spacious and overlooking the canal and very comfortable beds. It also came with free internet access. The staff were very helpful and friendly. The hotel does offer free internet and if you need it you can use their printer."], "common_summary": ["The rooms of the hotel are clean and the hotel is definitely recommended. The hotel is in walking distance to the sights. Despite being quite pricey the breakfast was super tasty and sumptuous.", "This is a highly recommended hotel with clean modern rooms. Additionally the hotel is peacefully located but close enough to walk to the centre of the city. The breakfast provided in the hotel was quite good too.", "The rooms at this hotel are very clean and the location is within walking distance to everywhere you'd want to go. The breakfast here is lovely, however it is quite expensive. Highly recommended."], "entity_a_uid": ["UR96431990", "UR7636116", "UR12844758", "UR8838616", "UR115778583", "UR97787723", "UR114888446", "UR70013333"], "entity_b_uid": ["UR126529324", "UR120306249", "UR77980942", "UR4599858", "UR31018035", "UR19018380", "UR116411217", "UR120194812"]}, {"entity_a": "86983", "entity_b": "87016", "entity_a_summary": ["This is a really great little hotel. It isn't a full-on resort but it was nice all the same. There are many things to do within walking distance. The hotel rooms are smaller, but clean and furnished well with antiques for some charm. The breakfast at the hotel was adequate. The coffee was great. There were some items missing and there was a run-down feel here. The carpeting did not help with the worn-down atmosphere. The elevators weren't that big either meaning a surfboard could not even fit in it.", "This hotel is currently undergoing renovations so the outside is an eyesore. Air conditioners are outdated and not well maintained too. There are great sights to visit nearby. Some of the rooms were small but nice, others smelled a bit so an upgrade may be necessary to get a nicer experience. The nicer rooms were very clean and decorated beautifully. The breakfast in the atrium is superb when there is enough food for everyone. The rooms could do with some upgrading as some of the carpet has been worn down. Items are sometimes missing from the rooms and the elevator is not big enough for a surfboard.", "This is a great hotel with nice touches but not a full resort some might look for. It appeared to be having renovation work as there was scaffolding and workmen there. Also, the AC barely worked and was noisy. The hotel is within walking distance to everything such as the International Market Place. Whilst clean and pretty nice the rooms aren't large at all and a little disappointing. Breakfast is average, but it can be enjoyed next to the indoor atrium for guests to enjoy. The carpet is in need of replacement and items in the room such as soap dishes were missing. The elevators were too small as well."], "entity_b_summary": ["A great stay at this hotel and will keep coming back. It can get really busy here but you wouldn't know it. The rooms in the hotel were luxurious but the walls were very thin. The hotel has good access to lots of local restaurants with a wide variety of choice available. There were some great aspect to this hotel such as the super-pool, although it is recommended you head down for a lounger quite early but this isn't a big deal.", "The hotel is very large and can accommodate thousands of guests but it still has that personal touch. It has a lot of shops and a selection of restaurants to attend. A perfect venue for those on their way through Hawaii. Whilst luxurious unfortunately the room has walls that are paper-thin. There is a nice view out to the sea however. You will feel spoiled by the twice-daily maid service provided. There is a good selection of restaurants available at the hotel. It is worth noting that you need to get down to the pool early if you would like a lounger, but it is worth doing.", "This is one of the busiest hotels on Waikiki beach. During a fully booked 'President's Week' it was busy but did not seem over crowded. The rooms are very luxurious that include stunning views from the small patio. However, the walls are thin so it does get quite noisy. The service provided is exceptional day and night. The hotel offers a choice of restaurants. Get down to the pool early to get a lounger for a day at the pool or get away on a day journey or spend a day at the beach."], "common_summary": ["This is a hotel resort that's in a good location for seeing the nearby ocean and beach and a good view of Hawaii. The staff at the hotel were very professional. Would definitely recommend the hotel.", "This hotel is highly recommended. The location of this hotel is perfect and not only provides great views but also close to the beach. The staff provide a really great friendly but professional service.", "This hotel is highly recommended. It is just across the road from Waikiki beach. The staff are really helpful and incredibly thoughtful."], "entity_a_uid": ["UR898800181", "UR524243685", "UR237009215", "UR643571556", "UR993890989", "UR752639907", "UR569266566", "UR767209001"], "entity_b_uid": ["UR599313126", "UR152757434", "UR514810687", "UR776348320", "UR355179625", "UR373100703", "UR857416342", "UR376066472"]}, {"entity_a": "203083", "entity_b": "208552", "entity_a_summary": ["The hotel is tranquil and clean and overall an enjoyable place to stay whilst in Rome. The hotel is close to a number of local restaurants and the busier areas of Rome. The rooms in the hotel are adequate with spacious bathrooms. The staff leave a chocolate on the beds each night for their guests. The buffet breakfast was very good. The hotel's corridors were quite plain and could benefit from some decoration. The free Wi-Fi worked well and the Bulgari toiletries smelled lovely.", "The hotel is peaceful, spotless and comfortable enough. The hotel's location is unbeatable and great if you like the hustle and bustle. You will be able to walk to main places in the city including great historical locations as well as some nice restaurants. The rooms in this hotel are always really nice and have good bathrooms as well. The sheets are always clean and there are delicious chocolates provided on the bed each night. There was the option to have pre-dinner wine while watching the sunset, which was lovely. There was free WiFi as well as gorgeous toiletries provided, which made for lovely soaks in the bathtub. The decoration in the corridors needed a little bit of updating but otherwise facilities were great.", "The hotel is in the Via Veneto area and is comfortable and quiet with clean rooms. The location of this hotel in Rome is great. It is close enough to the attractions of Rome to walk to most and there are plenty of really nice places to eat nearby as well. Some of the rooms are on the small side but an upgrade to one of the newly renovated suites will sort this issue. they are spacious and modern and very nice. You can start your day with a very nice buffet breakfast in the morning or having wine before dinner while watching the sun setting on the hotel's rooftop. This hotel has access to many amenities, including free Wi-Fi. Although some of the decor could do with being updated, it's got everything that's needed for a good stay."], "entity_b_summary": ["The hospitality here at this hotel was so lovely and made the stay really good. There's nothing at all to complain about and cannot recommend this place enough. Everything is so close to this hotel that it's perfect based on location alone. Historical sites aren't too far by foot and places to eat and drink are only 50 metres away, with the river nearby too. The rooms are bursting with character and really lovely with period decoration and style. The bed was large so that is a bonus. Many of staff members were able to provide detailed information about the city and ideas for what to do and where. The hotel provided a breakfast to guests that was adequate, but with a superb coffee available. The top-deck roof garden is really spectacular and live up to the photos provided on the website.", "The fantastic stay at the hotel made Rome even more pleasurable and they went out of their way to make the visit special. The hotel is located in the centre of Rome round the corner from the Campo de' Fiori. It is a 20 minute walk to Vatican City and 20 minutes to the Colosseum. The rooms in the hotel were perfectly adequate. They are in a European period style and furnished well. The bed was a good size and there was air con available in the room. Despite the sometimes noisy square nearby, nothing could be heard in the room. All staff members were approachable and kind despite being a wealth of knowledge. The breakfast was filling and plentiful, as well as some great coffee to go along with it. The hotel's roof garden is fantastic and the hotel is exactly as pictured on their website.", "The experience at Hotel Campo de ' Fiori was very special and wonderful. The location at this hotel is great for sight seeing. It is near Campo de ' Fiori and near central Rome and is great for food and nightlife. Also within walking distance to the river and many other sites including Vatican City or the Coliseum. Lovely rooms, designed beautifully in a period setting. The rooms are typically small in size, however they are loaded with charm and character that makes up for this, and the bathroom is fantastic. Although the location is noisy, you are unable to hear anything with the windows closed. The staff was knowledgeable about the city and the sights. This hotel offers ample breakfast but also drinks are available on the viewing deck, and the coffee is excellent. The hotel's roof garden is great."], "common_summary": ["The hotel is recommended and the staff were really helpful. The location is just near to the Piazza Navona.", "This hotel is really recommended because the staff are very friendly.", "This hotel is highly recommended and most of the staff is very helpful."], "entity_a_uid": ["UR84950314", "UR90640221", "UR118792784", "UR119004065", "UR124733792", "UR109152587", "UR76188254", "UR80926969"], "entity_b_uid": ["UR68772372", "UR81233771", "UR19077879", "UR116622801", "UR117621941", "UR43200846", "UR89094854", "UR122464312"]}, {"entity_a": "202988", "entity_b": "233491", "entity_a_summary": ["This flawless hotel provided a great stay and it's really recommended. The hotel is closely located to Giotto's Campanile. The rooms in this hotel are really great and quite spacious. There was some outside noise from the bells in the morning however. It was difficult to navigate the hotel due to the floor layout.", "The stay at the hotel was a brilliant experience and there were no faults . It was an impeccable choice to stay in Florence and was highly recommended. It is worth noting that you can clearly hear the bells from the Duomo in the morning, which may be a negative for some. Eating lunch on the rooftop terrace is a nice way to get a gorgeous view of the city. There were multiple levels on different levels, which could often make it difficult to get around the hotel.", "The hotel is simply beautiful and delightful. It was a really nice experience and though it was no Four Seasons it was the excellent. The room was great. The breakfast buffet was great but why not take a picnic to the rooftop terrace for some really nice views."], "entity_b_summary": ["The hotel definitely warrants a repeat visit. It is really quiet on a side-street. There is also a convenient hop-on hop-off tourist bus that isn't too far from the hotel, too, so that's really helpful for sight-seeing. The rooms in the hotel are clean but simple with a view over the rooftops. There was a grand continental breakfast that was really tasty.", "This hotels provides a fabulous and wonderful stay and great Italian experience. The location is only a few minutes walk from plenty of restaurants and the Accademia gallery. Close to the hotel there is a bus station, on the Piazza San Marco. There are rooms with a balcony and amazing view of the city here. The decor is a bit basic but it's all very clean. The hotel provides a Continental breakfast with lots to choose from . This can be had from a gorgeous sun-lit breakfast room from two self-service tables. The shower was really good because it was in the American stand-up style.", "A wonderful hotel, full of charm and perfect for an Italian experience. The decor is beautiful and the cleanliness is to a high standard. The location is in close proximity to a wide variety of restaurants. Although it is nicely tucked away in a quieter, less touristy area, there are still regular bus lines that run close by to this hotel. The rooms are clean and simple but spacious. This is an old, refurbished building with thin walls but the windows are double-paned so the noise is reduced in the rooms and the bathrooms could use some updating. The breakfast offered by the hotel was excellent and offered a lot of choice and is included in the room price. In close proximity to an excellent four star hotel, with excellent features in the bathroom."], "common_summary": ["The staff at the hotel are very helpful. The location of this hotel is simply superb becaus it's in a central location close to downtown sights and also more representative of locals.", "The hotel is wonderfully located only a few minutes' walk to the Duomo, great destinations and popular sites. To add to this the staff are really helpful.", "The location is great. It's close to the Duomo, and only a couple of streets away from the piazza and is at the heart of the city. With easy walking distance from some of the major attractions. The staff is friendly."], "entity_a_uid": ["UR686217376", "UR501692172", "UR832623175", "UR386605870", "UR888442750", "UR777178255", "UR756346455", "UR910157851"], "entity_b_uid": ["UR503942214", "UR789880965", "UR568782149", "UR560865850", "UR981983919", "UR920953947", "UR528025758", "UR345691393"]}, {"entity_a": "313193", "entity_b": "203093", "entity_a_summary": ["This is a great place for a short stay and it will likely make you want to come back again. The hotel isn't really central. The area is quite safe so really the location is pretty good. The rooms in the hotel are modern. Some of the hotel's staff seemed disinterested in helping with an incident at the hotel. It is worth mentioning that you can get a complimentary coffee from the barista. There is a coffee machine supplied here, which is fine. The parking at the hotel costs 12 a night.", "The hotel is an ideal place for a short trip. The hotel is not in the centre of Rome. The rooms are mostly very clean and are quite decent with a modern feel to them. A downside was upon opening the window to find a lot of black mould. Some of the staff members didn't respond well to an issue that occurred. They showed no apathy or even any interest after the incident and that really let the staff down. The coffee here at the hotel is good and you can get free cappuccinos from the barista as well. The parking at the hotel can be expensive, costing around 12 per night.", "An excellent hotel that comes highly recommended for short stays in Rome. This hotel is not based in the city centre. Well maintained rooms, that are cleaned to a reasonable standard. However, there is an issue with black mould around the windows, and there is no air conditioning available. Generally speaking the staff at this hotel are disinterested and apathetic. The breakfast at the hotel is good and offers a variety of options and you can get a free cappuccino from the barista. Car or van rental is an option but comes with a parking fee of 12 a night. Also, there is a Nescafe coffee machine which is ok but a barista is located nearby."], "entity_b_summary": ["The hotel made guests feel safe and comfortable. Everything is accessible from this hotel, which is really useful for exploring the city. There are lots of attractions you can reach by foot. The hotel has adequate rooms with air conditioning and the internet was available. The staff of this hotel allowed a call to the USA using the hotel phones. The complimentary breakfast buffet provided by the hotel was generally good, but the restaurant left a bit to be desired. The temperature at this hotel did not help when trying to sleep and unfortunately the charge for a brief call is really expensive.", "This is a really comfortable and secure hotel that will provide happiness. The hotel is in a good central location and a short walk to Termini train station. There are several restaurants close to the hotel. The rooms are of a decent size at this hotel and they also feature wired access to the internet. The baths are pretty large in the bathroom. There is a breakfast buffet supplied for free here and it's really good. The restaurant at this hotel could be better though. The temperature within the hotel was not comfortable and the charge for a timed call of two to three minutes could be as much as $40USD.", "Guests are made to feel very secure and comfortable at this hotel. The hotel's relatively quiet location is centralized in Rome and close to several other hotels, good restaurants. So much is within easy walking distance and a lot of Rome is very accessible this way. Very spacious rooms for guests to enjoy, with air conditioning for guests to make good use off. This hotel has a fantastic breakfast on offer and it is complimentary though the restaurant could be better. The phone charges for a brief call was over $40."], "common_summary": ["Some of the staff at the hotel were helpful. If you want to go a little further afield there is a train station close-by.", "The location very close to the train station. You will find the some of the staff at this hotel are super helpful.", "A great place to stay. The location is cloes to the main Metro train station. Some of the staff were helpful."], "entity_a_uid": ["UR7332276", "UR7655957", "UR85762279", "UR124060664", "UR121114425", "UR5930148", "UR6784628", "UR18723067"], "entity_b_uid": ["UR115663125", "UR126477483", "UR124033192", "UR123696867", "UR116317029", "UR80465693", "UR34611916", "UR65222357"]}], "test": [{"entity_a": "296582", "entity_b": "294609", "entity_a_summary": ["The hotel is decent and a great choice if looking for a cheap, clean, and secure place to stay. The hotel is close to the Grand Bazaar, Blue Mosque and the tram lines for transport around the city. The rooms are pretty comfortable but this room in particularly constantly had smoke blowing up from the lobby. The staff at the hotel provided a good service. The hotel had breakfast included in the price of the stay. One thing to note with the hotel is that there is only a one way transfer, so you will have to pay for either the pick up or the drop off to the airport.", "The hotel is cheap, clean and has good security. This hotel is situated in a really convenient location for those who wish to see some of the grand sites this place has to offer, whether it's the bazaar or religious sites. The rooms in the hotel are comfortable, although cigarette fumes often drifted into the surrounding rooms. The staff will provide a really great service at this hotel. The breakfast is included in the excellently valued price. Unfortunately the one-way transfer provided is a slight inconvenience but it's not a big problem because it is actually quite cheap.", "This hotel is a great choice for those looking for a cheap stay in a clean and secure hotel/hostel. Excellent location for those wanting to explore. This hotel is not only on a quiet street for those that want to relax, but it is conveniently close to the main sights as well as the seashore, where guests can enjoy a good run. Very comfortable rooms, however there is an issue with cigarette smoke from the lobby drifting into the rooms. Breakfast came with the stay. The airport transfer pickup costs are extra but they are cheap."], "entity_b_summary": ["The hotel looks a bit dated but overall a good place to stay. The hotel is located on a hillside and has views of the Bosphorous. The rooms are really big and spacious as well as refurnished and clean. As well as a nice room the bathroom is also of a great size. The staff at the hotel were very attentive. The food is okay enough but there are quite high prices. The hotel does provide internet access for guests, but it is steeply priced at $25 per day.", "Whilst it looks a little outdated the hotel provides a great experience, therefore it is highly recommended. The hotel's location is pretty good with some good restaurants and shopping nearby. There is a good view and great access to the river, too. The hotel rooms are large and fully furnished . The bathrooms are also spacious with all of the expected amenities. The staff are so attentive and they keep the hotel nice and clean. The hotel has a varied choice of restaurants available , but the coffee shop and food in general are not up to regular Turkish standards. The highlights of this hotel would be the turn-down service in the evenings (they would even provide fresh bathrobes, which is a great added touch.) Whilst the in-room internet service costs a lot of money there are some really great views from the hotel.", "A highly recommended hotel that has luxuries such as its own spa for guests to enjoy. A great experience to be had here, although the outside of the hotel could do with being updated. The location at this hotel is great. It sits on a hillside with 60 acres of garden to enjoy and offers fantasic views of the whole Bosphorus as well as being close to several restaurants and shopping. The rooms at this hotel are particularly large and spacious. The bathroom in particular is of a decent size. It has been refurnished and includes all amenities. The staff at this hotel are very good at paying to the needs of their guests, and the on site security make you feel safe with the guard house, barriers and metal detector to get to the reception. The quality of the food at this hotel is good, and there is a good selection of restaurants to choose from. However, the food can be pricey and it doesn't quite meet Turkish standards. The cost of $25 per day for in-room internet service is a drawback."], "common_summary": ["The hotel had a great breakfast provided and the staff were always friendly. The location is ideal.", "The hotel is located in a great area and the room with a view was overlooking to Bosphorus. On top of this the staff were all friendly and super helpful.", "The hotel's location is great with its views of the Bosphorus. The breakfast is good, the staff is friendly and helpful and there is free internet."], "entity_a_uid": ["UR24322355", "UR21833260", "UR104347625", "UR41005918", "UR14776113", "UR56367345", "UR17610164", "UR118411141"], "entity_b_uid": ["UR113512283", "UR110713802", "UR73202909", "UR125956962", "UR115016862", "UR106047101", "UR49475794", "UR120182928"]}, {"entity_a": "305947", "entity_b": "305813", "entity_a_summary": ["The facilities of this hotel are really great and therefore it's one of the most enjoyable stays. The location of the hotel was rather disappointing and not a very scenic area of Hong Kong. The hotel's rooms are adequate, although perhaps a little darkly lit. The rooms are clean and quiet, although for a more updated room it is worth booking a room on the Club floor. There is nothing the staff find to be too much trouble. The buffet breakfast is absolutely amazing and really varied. In addition the restaurant provides some really good food that's worth trying. The hotel has a bi-hourly bus shuttle service available to guests. It is not worth getting a hotel with a pool as it is often not the climate for swimming etc.", "The Metropark Kowloon is very cost effective and ideal for those who need to crash after a hard day's sightseeing and travelling. This hotel isn't in the best location but there were some bargains to be found at a nearby market. There are bus routes however so that is a bonus. The hotel room was spotless and quiet therefore peaceful. All amenities were sufficient enough for all needs and the size was fine. TThe breakfast buffet provided at the hotel had a lot of variety. The food in the restaurant is good and the Sip Sip bar had a wide range of cocktails on offer. There was free internet connection provided here and the 30 minute minibus service was really great and also free.", "This hotel has two restaurants, is perfect for resting, is great quality and a good price. The hotel has a Club area which is comfortable and offers tea or coffee and newspapers on offer. Great for sightseeing or shopping but the facilities at the hotel are good too. The location is okay, it is not the nicest of areas but there are some attractions that are walking distance from the hotel. This hotel's rooms are clean and comfortable and include amenities in the bathrooms. The lighting isn't as bright as it could be. The hotel buffet looks very nice and the breakfast was plentiful. Coffee, tea, and drinks were also available and the restaurant food was delicious. The hotel provides many amenities for its guests, including free Wi-Fi and a mini bus shuttle service."], "entity_b_summary": ["This is such a great hotel it's highly recommended and you won't regret booking again and again. The rooms are a good size and with a good view. Some of the staff were not highly trained or had a bad attitude. The multicultural food was really welcomed as it was of great quality and taste. The hotel provided free DVDs for guests.", "The hotel was a great place to stay and comes highly recommended. The spa was incredible. The area the hotel is located in is not very nice to walk in. Generally a really nice room with great views. The bed was a bit firm but the room itself was lovely. It is clear that some of the staff need more training and a more professional attitude in dealing with problems. The food at the hotel offered a multi cultural selection .", "Langham Place does not disappoint with its new shopping mall and spa. This hotel is attached to the mall and cinema which was great because sometimes this location has unpredictable weather. Medium sized rooms that are to a high standard with excellent views. Rooms are well maintained, with standard beds. Some of the staff was lack training. A buffet style dinner is offered every evening, and the quality of the multi cultural cuisine is generally well liked amongst guests that visit. The food options can get repetitive if staying for a longer trip, however your money goes a long way when eating at this hotel. The daily cocktail hour is also worth a visit, alongside daily nibbles provided by the hotel. The hotel provided free DVDs for guests to watch."], "common_summary": ["The staff at the hotel were generally friendly and helpful.", "The staff could not have been more helpful.", "The staff at the hotel were mostly helpful."], "entity_a_uid": ["UR80720189", "UR118698370", "UR120274112", "UR87971551", "UR128633829", "UR73560234", "UR33683613", "UR6784461"], "entity_b_uid": ["UR889070422", "UR396530489", "UR822207890", "UR731453084", "UR426621627", "UR403460271", "UR462188982", "UR696543924"]}, {"entity_a": "94371", "entity_b": "111418", "entity_a_summary": ["A unique hotel that provides a similarly unique and unforgettable experience. It can't be recommended highly enough for the convenience and friendliness here. The location is superb. It had absolutely in the center of everything you could need. The hotel rooms are decorated sophistically, although the TV was very small. Exceptional service; every member of staff on front of house were super polite, courteous and so thoughtful. Brasserie Jo, the restaurant attached to the hotel, is excellent with delicious food, charming atmosphere , and the best service. There's a good gym in this hotel. It is on the fifth floor and features some cardio machines.", "The Colonnade Hotel is a great place to stay and highly recommended. A comfortable and unique atmosphere. The hotel is situated centrally in Boston for activities. It is in close proximity to a number of locales, such as a T connection and the Hynes Convention Centre. The rooms in this hotel are really comfortable with nice features such as feather pillows and comforter. The television was however on the small side. The hotel's staff are fantastic, from arrival to departure. They are helpful and a good face for the hotel. The front desk staff, the concierge Jerry Good and the doorman Norman Maines are of particular note. The restaurant, Brasserie Jo is excellent with delicious food. The hotel has a gym that is usable for guests.", "This hotel comes highly recommended, leaving visitors wanting to come and stay again. From the beginning to the end of a visit, this hotel provides an exceptional experience in every aspect. The hotel is close to the central activities of the city with the Convention Center nearby. The decor of the rooms are to a good standard, with very comfortable bedding. However, the size of the TV is quite small in comparison to other hotels. From check-in to check out the staff was fantastic. They were thoughtful, and polite and always courteous. Norman, the doorman, Jerry, the concierge right through to the front desk staff were all particularly outstanding. The hotel's restaurant, Brasserie Jo, is very good . It has a great atmosphere and food is provided with great service. This hotel provides a decent sized gym which has a variety of cardio machines on offer for a varied work out."], "entity_b_summary": ["This is a perfect hotel for any type of stay and you will want to keep coming back for the tranquillity, unbeatable price and the quality. The hotel is very close to the Boston public gardens and the Arlington stop of the T line. The rooms are smaller in size but are decorated with a homely charm. The staff at the hotel were professional and also rectified any problems that occurred. The hotel 's Christmas Tea was particularly enjoyable, as well as the famous seafood available in the restaurant. The hotel itself has elevators that malfunctioned repeatedly while staying here, including stopping between floors after electricity completely cut out.", "The hotel was available with a deal through Priceline, but there were some maintenance issues that tarnished the stay a little. In general, a great place to stay for a trip to Boston. The location of the hotel is great for accessing nearby attractions and places to eat. Newly updated rooms, with upgrades on offer for guests to choose if they want to. The upgraded rooms in particular are an excellent size and there is wireless internet for guests to enjoy. Staff at the hotel is very helpful and always available to answer questions. They are very professional and make you feel comfortable. There are plenty of food choices here including seafood. There is lunch provided in the hotel's restaurant too. The hotel's elevators seemed to be malfunctioning a lot.", "This hotel is perfect for a mixed business/pleasure stay in Boston at any time of the year or season. It is reminiscent of vintage class when quality was key and mattered most. Travel the world and come back, this may be the favorite place. With a central location, the hotel is really convenient for the Arlington subway stop, and the Boston Common. If you politely request you can get a really great room on the eighth floor which is a King room. It's really big and has free breakfasts and appetisers as well as WiFi internet. Reasonable service at this hotel, with many members of staff very attentive to their guests. The security team were not so helpful but overall the staff seemed quite professional. Food-wise, the hotel does have, The Whiskey Bar, a hotel restaurant and seafood. They also had a special treat of Christmas Tea. The elevators were not working properly and kept getting stuck between floors."], "common_summary": ["The rooms in the hotel are clean and comfortable and the staff were friendly and helpful. The location is also ideal.", "The rooms are perfectly spacious, clean and comfortable. The hotel is well-located as it is within walking distance to some good sights. Finally, the staff were always friendly and helpful too.", "The rooms in this hotel are very clean and comfortable and the staff are helpful and friendly. The hotel is close to numerous restaurants and two shopping plazas."], "entity_a_uid": ["UR3984454", "UR125539455", "UR116564478", "UR122793292", "UR54912132", "UR109742962", "UR119561795", "UR124615873"], "entity_b_uid": ["UR46670397", "UR43341366", "UR5339391", "UR77590523", "UR94849210", "UR10453833", "UR19621355", "UR56942449"]}, {"entity_a": "614392", "entity_b": "280922", "entity_a_summary": ["Highly recommended hotel that you will want to come back to because it is definitely five-star. The hotel is only a minute from the beach in both directions. The hotel also has a rooftop pool with a view of the sea too. The hotel is located near to the Port Olympic and Barcelonetta. There is also a fitness park a two minute walk away. The hotel room had a good bathroom, but the pillows and linen were a bit uncomfortable. The bed was a good size and there was a large TV, WiFi etc. The room was specious and clean and also had a sea view. The food was really good here especially the breakfast. Sometimes the restaurant did not open for dinner but the chef would be flexible for a small party, which is great. The pools were a great addition to this hotel as well at the fitness centre. There's even a Jacuzzi on the rooftop, which was really fun.", "The hotel is definitely worth its five star rating, although it is expensive. The hotel is ideal for a combined city and beach holiday. This hotel is set so close to the beach that you will not need to walk too far. Additionally there are wonderful views from the top of the hotel, reminding you of what a great location you are staying in. The bed in the room didn't have the softest linen and the pillows weren't great either, but the bed itself was comfortable and everything was in good condition. There is WiFi in the room as well as a nice big television.The hotel had a lovely bar/restaurant overlooking Barcelona, but be warned that it can be expensive. Also note that the restaurant is not available every day, but they can be flexible in providing catering on request. The hotel has some great facilities. There are two pools, a rooftop Jacuzzi and a fitness centre all within the hotel.", "The hotel is worth the higher price. It has a rooftop pool as well as a ground-level pool and is perfect for either a beach vacation or city break. Great location only a minute or so from beaches in both directions and close to Port Olympic as well as a fitness park two minutes away from the hotel. Beautiful, luxurious bathrooms that are in an excellent condition. All amenities are available in the rooms, and those on the higher floors have the luxury of stunning sea views. Wow! The food was really nice with affordable breakfast available at a nearby cafe if you prefer. The restaurant wasn't always open but breakfast was lovely. The hotel has two pools a fitness centre and also a jacuzzi on the rooftop."], "entity_b_summary": ["The hotel is good value for money and in a secure part of the city. The hotel is in an industrial but safe area not too far from the city centre. The hotel had air conditioned rooms with a mini bar and a view of the Sagrada Familia, but they needed a small touch up. The cleaning staff made the hotel an incredibly clean environment. There was a complimentary mini bar included, although it was not restocked. The breakfast served a selection of pastries, cheese and breads. The towels in the hotel are too firm.", "This hotel will provide a pleasant experience at a four-star rate as expected. It is good value for money and it delivers on every stay. This is an optimal location because you can easily access restaurants by foot as well as public transport for quicker access further afield. Inside the room there are great views and it is of a medium size. There is a free minibar included as well as air conditioning to make the room even more comfortable. The morning buffets were really tasty and featured plenty of pastries, breads and cheeses. You will find there are plenty of choices for even fussiest of eaters. If you don't mind cardboard towels and industrialized areas, this is the hotel for you.", "This is an excellent hotel with good value and you get a 4-star hotel experience. The area feels very safe as well. . The location isn't particularly nice to look at it as it's industrial, however it is short walking distance to many of the main attractions in this area and the metro. The city centre is in close proximity also, when using public transport. These rooms are to a high quality. great for comfort and they have excellent views from the window. Everything needed is there to enjoy a quick stay. The cleaning staff were really great at what they do as they leave all areas immaculate they're so thorough. Good breakfast buffet that offers a selection of foods to start your day, catering for even the most fussy of eaters. Decent hotel, however the towels provided are of a poor quality and there are little views on offer due to it being in an industrial area."], "common_summary": ["The staff of the hotel were very helpful and the rooms are comfortable.", "The hotel staff always provided a great service and were very knowledgeable so super helpful.", "The rooms are large and and comfortable and the staff are all very helpful."], "entity_a_uid": ["UR115086102", "UR113675688", "UR98083392", "UR126986096", "UR125875341", "UR24865171", "UR76017895", "UR123069786"], "entity_b_uid": ["UR7634322", "UR102638327", "UR126908422", "UR96973821", "UR13894569", "UR91658183", "UR68812108", "UR115022170"]}, {"entity_a": "1389502", "entity_b": "87603", "entity_a_summary": ["The hotel was great and comes highly recommended. The hotel is close to transport networks. The modern rooms were really clean. What really stood out was the thermostat that controls the heat and coolness of the room. The complimentary breakfast provided by the hotel was substandard. The hotel has a thermostat control.", "You could stay here for pleasure or otherwise because it's such a great hotel. The public transportation is incredibly close. The hotel has modern rooms, even having a thermostat control for the room's temperature. Whilst the breakfast was free it felt a lot more like a soup kitchen with massive lines and nowhere to even sit. There was a thermostat that was useful for controlling how hot or cool you would like it to be.", "Brilliant hotel, whether you're visiting for business or pleasure. Public transportation is also easily accessible for guests to go and explore further. The rooms at this hotel are very clean and modern. "], "entity_b_summary": ["This hotel was not worth the price paid for it. The hotel is situated in an excellent location on the river. The rooms were very large with a great view of the Chicago River although at times smelt unsavoury and had a dirty bathroom. The hotel did not have a drinks vending machine or fridge and the toilet paper was of a poor quality.", "Considering what you pay for this hotel your expectations might be a little too high because it only provides typical accommodations. The hotel provides a great view of the city. Additionally there is a lovely river nearby as well, which gives the best view of the river. Also included is a huge bathroom with separate sinks as well as separate bathtub and shower. The deluxe room itself was particularly big. Sadly there was no mini fridge available to eat and drink anything in the room and there also wasn't any vending machines for snacks or drink. The toilet paper at this hotel seems quite cheap.", "Considerably expensive for what was provided, however overall it is a beautiful place to visit. The location is being near the river and it offers great views of the city. Large, spacious rooms with excellent views of the Chicago River in some. However, the cleanliness isn't a high quality and could be improved. There were no vending machines with soda and no mini-fridge. "], "common_summary": ["The hotel is in a good location. You can also walk to a lot of places in the city. The staff were very helpful. Would definitely recommend to stay at the hotel again.", "This hotel is perfectly located in Chicago which is really close to att the attractions. Not only that but the staff are hugely helpful and always so friendly. You will definitely want to stay here again.", "This hotel's location is perfect with attractions close by. The staff is very helpful and friendly and you'll want to stay again."], "entity_a_uid": ["UR83176488", "UR116102636", "UR113409279", "UR125022168", "UR81217565", "UR107862303", "UR86104496", "UR72236445"], "entity_b_uid": ["UR114613441", "UR114118977", "UR68596071", "UR119954489", "UR125709199", "UR115446579", "UR83314104", "UR75755138"]}, {"entity_a": "304824", "entity_b": "294658", "entity_a_summary": ["It's a good hotel and would definitely recommend as well as return for another stay. The hotel is in a perfect location in the old quarter of Istanbul. The hotel is within minutes of the Blue Mosque and the Grand Bazaar, along with many other traditional and historic places in Sultanahmet. The rooms here are cosy and on the small side but always very clean and comfortable enough. The staff were knowledgeable about the local area. The breakfast was fit for a king so that's definitely recommended. There was nothing not to like especially with breakfast on an open terrace. The hotel provides complimentary internet access in the reception.", "The hotel was a wonderful boutique style and there were some pleasant surprises provided such as wines, fresh fruits and transport provided to the hotel. Highly recommended. Everything is within walking distance from the hotel here including the public transportation, which you can take to get to the main street. The rooms in the hotel were a little small but clean and comfortable. There is no WiFi available in the room and not a lot of room for storage. The staff are so helpful and always willing to help out with their polite manners. The hotel provides a great breakfast and both breakfast and dinner can be enjoyed at the rooftop dining area. There was an unexpected bonus to this hotel and that is the reception area provides guests with free internet access.", "A highly recommended hotel that goes above and beyond for its customers, including arranged transfers to the airport and fruits and wine. With only a 5 minute walk to places like the Grand Bazzar or the center of Istanbul's old city, views of the Bosphorus this hotel sits in the old quarter and isn't far from popular tourist spots. It's rooftop terrace also offers views of the Golden Horn and the Blue Mosque and the sunsets are amazing from there. Although the size of the rooms here are small, they are well furnished, clean and comfortable. The only downside to the rooms at this hotel are that there is no wireless internet available unless you're in the lobby, and the rooms can seem quite dark to be in. The staff was okay. They were polite and helpful when they needed to be. The breakfast was Kingly. Very good. Having free WiFi in the lobby was a pleasant surprise."], "entity_b_summary": ["This is the perfect hotel for both leisure and business stays and is a welcome breath of fresh air for the hospitality industry. You can walk across the park near the hotel to a number of restaurants. The hotel's rooms are modern, adequately sized.and competitively priced. It is even possible to see the Bosphorous from some of the rooms. The staff based at the hotel were generally good, but there were some instances of unprofessional conduct. Unfortunately the dial-up service to access the internet is a paid service. Additionally the gym is pretty small but it's fine for a quick workout.", "The Conrad hotel warmly greets its guests upon arrival and are far beyond the expected norms when it comes to hospitality. The hotel is just across a park from many popular restaurants. At this hotel the rooms are of a decent size with modern facilities and look. The views are good from the room and the price was a competitive rate. For the most part the staff at this hotel are really great and make you feel very welcome, especially with personalised messages and general friendliness. They handled any requests efficiently and had plenty of recommendations for resources. All meals here were delicious however they shut down the bar at a designated hour. The hotel has a small gym on site which is ideal for a workout. Some of the floors on the hotel you will need to pay for dial-up internet.", "The Conrad hotel is great for business or pleasure and the staff greets its guests with personalized attention the moment they arrive which is so rare these days. This location is quite out of the way so it is best to book somewhere close to where you plan to visit. The area's small restaurants are local university students' favourites so that is something to bear in mind. The rooms at this hotel are modern, clean, and nice. Views of the courtyard are lacking inspiration where the picturesque scenery of the Bosphorous was lovely. The staff offered a very friendly service along with a personalized message from the manager to warmly welcome visitors to The Conrad, Istanbul. They were efficient and quick and informative about everything available to guests of the hotel. Delicious food that you can enjoy while looking over at some fantastic views of the Bosporus. This hotel provides a small gym that can be convenient for those wanting to complete a quick work out. Although the location of the hotel is slightly out of the way, it is still suitable for those visiting for business."], "common_summary": ["The hotel is definitely recommended.", "This is a recommended hotel.", "This hotel is highly recommended."], "entity_a_uid": ["UR105820478", "UR38559972", "UR113354113", "UR32370072", "UR47579108", "UR46360954", "UR56035478", "UR96395419"], "entity_b_uid": ["UR128296882", "UR29165399", "UR128187728", "UR6694192", "UR116227695", "UR119838088", "UR89325717", "UR37728519"]}, {"entity_a": "238569", "entity_b": "503506", "entity_a_summary": ["The price of staying at this hotel was reasonable. The hotel is located in the city centre and right next to a canal. The rooms of the hotel can be small and with little beds. The rooms are good value and are clean and well furnished. The continental breakfast was a bit limited but it did taste great and it was provided by the hotel for free. The hotel did provide free internet access. However, be warned of the steep stairs if you have heavy luggage. The hotel is gay friendly, but there are homosexual pornographic materials left out in public areas.", "This hotel is reasonably priced and has great style to it. It will provide a perfect stay. The hotel is centrally located therefore close to everything and for the price it really makes this hotel great. The rooms are very nice and clean but be sure to book a large room or you will end up with small beds. The hotel provided a complimentary Continental breakfast with hot drinks available at all times. Food is served in a reserved dining room. Hotels here are not cheap and very often are quite small. In this hotel there are quite steep stairs that make large suitcases quite hard work.", "A really nice hotel with ok prices and a unique style. The location is idyllic for those wanting to explore the area, as it is in close proximity to the city centre and station, with many of the main attractions only walking distance from the hotel. The room is nice but a little small. They are of a good value though and features nice high-quality furnishings. A great continental breakfast provided at this hotel, with a varied selection of foods. Although not quite a buffet style breakfast that some may prefer, all food and drink comes free as part of the guest's stay here. Not cheap, smallish rooms and steep stairs so take care."], "entity_b_summary": ["Overall the stay was pleasant enough at this unusual stand-out hotel. Would recommend and also come back again. This hotel is perfectly situated for access to the main city as well as for a peaceful walk or job along the waterfront nearby. Additionally there are some restaurants and deli shops not far away that many locals tend to visit. Some rooms in the hotel have an open toilet in the room which may be an issue for some. There is complimentary internet provided in rooms. The staff at the hotel were often unfriendly and did not finish tasks. The restaurant at the hotel is good, but the wines can be expensive by the glass.", "The hotel was a unique, historical building and different from your standard fare. It is worth noting that the walls and floors were damaged though. The hotel is a few stops on the tram to the centre of the city. There are restaurants, shops and delis all close to the hotel. Whilst the quirky room had decent, working and free internet, it did not make up for how dirty the room was overall. The staff are sometimes helpful and sweet but forget to finish tasks and can be unfriendly at times. The hotel restaurant has a nice choice of wines but the meals cost a bit too much. It was ok. There is a very nice fish shop in the mall though. This hotel is unfortunately really expensive especially when compared to the performance of the hotel.", "The hotel is in an old building. The walls and floors were damaged but it was still nice. The hotel's location is close to the tram line and train station which can take you into the city. There are many restaurants and grocery stores and delis to visit if you want to see some of the local life. The waterfront is also close by for a walk or run. The rooms at this hotel are okay. Free Wi-Fi is on offer, and they are large and very comfortable. The main issue with these rooms is that they have an open toilet, which isn't idea when there is more than one person occupying a room. They could also do with being cleaned more regularly as they are quite dirty. The service is to an average standard. Staff are not always friendly and there can be a language barrier. The restaurant at this hotel serves reasonable food, however it can be quite expensive. Thievery occurred from locked luggage."], "common_summary": ["Some of the staff at the hotel were helpful and amiable to guests.", "The staff at the hotel were compassionate and helpful.", "The staff at the hotel are very helpful and friendly."], "entity_a_uid": ["UR14071531", "UR101559181", "UR117311974", "UR12402232", "UR114869814", "UR5711537", "UR117371435", "UR6595196"], "entity_b_uid": ["UR116020720", "UR101508237", "UR120001082", "UR106192226", "UR61272255", "UR10043914", "UR114467217", "UR118356485"]}, {"entity_a": "781650", "entity_b": "1022738", "entity_a_summary": ["The hotel is situated about five minutes away from the airport and offers a free shuttle service to the downtown area at twenty minutes past the hour. The two-bedroom suite in this hotel was stunning and really impressive. There were lots of nice features such as granite worktops, marble flooring, stainless steel appliances for guest use, and the bathroom featured Jacuzzi tubs and a really big walk-in shower. The breakfast passes only included the fruit and bread. The parking facility at the hotel cost $18 which is expensive, and the water at the hotel was discoloured and riddled with seaweed.", "The hotel in Key West has lots of water activities to take part in. There is a small sandy beach nearby but as this hotel is not in the heart of all the action the hotel themselves provide a free shuttle service downtown. The rooms of the hotel were really good. They had a view of the water across two balconies. The rooms had a large living area, dining area and kitchen facility. The kitchen has granite counters and stainless steel appliances, all high end. The bathroom was fantastic with jetted hot tubs and a walk-in shower. The staff were good at this hotel and very accommodating to you. The breakfast was pretty limited as a Rewards member who receives a breakfast pass - the hotel only supplied fruit and bread areas without even including the typical powdered eggs. The parking is $18 at this hotel and its water looks dirty, even full of seaweed.", "This Marriott is nice and comfortable. There are lots of water activities but no private beach. Perfectly located to the airport as it is just a quick car ride away. Although it is not in the heart of the city, there is regular transportation via the free shuttle service. Remarkable rooms that provide stunning waterfront views. Each room is extremely spacious and there is the option of a Jacuzzi bath tub as well as a shower. The rooms are quite pricey, and it is worth upgrading to experience the luxury of a beach facing or poolside room with a balcony. The staff was very nice and the management was extremely courteous. Highly priced parking at this hotel, and the water provided is particularly dirty."], "entity_b_summary": ["The resort will have you wanting to keep coming back because it is really relaxing and welcoming. The hotel was a short taxi ride away from the town centre. It was quite a drive to Duval Street and this was rather expensive in a taxi. The room was beautiful and has amazing views. With regards to the bed in the room it had great quilted bedding. You could not wish for better staff service here because it is five-star. They were really helpful as well as friendly and welcoming. There are some great salt pools where you can sip some cocktails and achieve some peace and tranquillity. The price is quite steep however there are four amazing pools and an outdoor bar, so would definitely come back again.", "The hotel resort is incredibly relaxing and a home away from home. The only downside is that it is quite expensive. This is a great tropical location but a taxi ride is usually required to get to most places. The hotel provides an ocean view to rooms on the upper floor. Also worth noting is the quality of the room's bedding. The staff were very welcoming and courteous and are highly recommended. The hotel provides cocktails in one of their three salt pools. The hotel has some pleasing features such as four swimming pools and porches areas, but the price can be expensive even if booked in advance.", "A resort with the perfect mix of relaxation, and a chance to catch up on some well needed sleep. This hotel is situated a short drive away from the busier, tourist areas that can be taken via taxi. However, the taxi to the downtown area is quite expensive. Ocean views were only available from the upper rooms due to the foliage but the cottages are great with really impressive bedding and the grounds are gorgeous. There are even little porches to enjoy. The staff was great. They were friendly and very helpful and went out of their way to make their guests feel at home. The hotel has little porches and you can relax in one or all of the four pools which also include an outdoor bar."], "common_summary": ["This hotel is really enjoyable and definitely recommended. The rooms of the hotel are clean and spacious.", "A highly recommended hotel. The rooms here were always clean and spacious as well, featuring some nice furnishings.", "The rooms are nicely furnished and spacious. Highly recommended for stays, weddings, or last-minute bookings"], "entity_a_uid": ["UR120751114", "UR119970445", "UR113146588", "UR126366012", "UR22446276", "UR115572028", "UR74444513", "UR103081787"], "entity_b_uid": ["UR87502270", "UR121886991", "UR96233880", "UR71554582", "UR120527285", "UR108252946", "UR122691784", "UR116350995"]}, {"entity_a": "278196", "entity_b": "289202", "entity_a_summary": ["This lovely and charming hotel can be busy during September time. This hotel is nicely located in quiet neighborhood and also close to the best things to do in Venice. The room were clean but it seems more like a dorm than a hotel room. You need to spend extra 20 euro for an upgrade. Very friendly owners. While the breakfast is basic here the breakfast area is quite small and it gets filled up fast, there are lots of places near by; the staff will even make a reservation for you. The local boat trip to Murano is worth it but the advice would be to go on the normal boat.", "The hotel is generally good but may be a little difficult to find. The hotel really nicely located off the beaten path, hidden away in a quiet neighborhood. It is great once you get your bearings in Venice and is close to everything but the trip to Murano, though free, is not good. The room was clean with a good price for Venice. It was more of a dorm room than a hotel room away from the main hotel but we were eventually able to get a lovely room for an additional cost. The owners of this hotel were very friendly. The hotel offers a basic breakfast but the room is too small and fills quickly. There are places to eat nearby but you can also book a place in the restaurant. One boat tried was the size of a box so if going to Murano, go on the normal boat.", "This is a charming hotel with several factories and shops nearby to give you choices in your shopping experience. Even during the busy September season, it is a enjoyable experience. And don't worry about being able to find it. It's no drama to locate and everyone will enjoy their stay. The hotel was well located and right on the Grand Canal. The hotel was located off of the beaten path so you can avoid a lot of tourists. The location was central for the main water boat routes too. The room was lovely, although across from the main hotel. It was a second floor corner room that was a bit smaller than anticipated, but at a good price and very clean. The owners of the hotel were welcoming. The hotel's breakfast was adequate although a little basic. The hotel can book the restaurant for you at your preferred time. The best way for hotel guests to go to Murano is by normal boat."], "entity_b_summary": ["The hotel is definitely recommended for others, but it is a little remote for some. The hotel is located on the Grand Canal and opposite the Santa Lucia train station. It is in a less buys part of the city but a gentle walk to all of the tourist sights and boat routes. The rooms in the hotel have a view of the canal. The rooms are light and well maintained. The bathrooms have twin basins which is ideal for a couple. The staff at the hotel were helpful and knowledgeable. The breakfast provided by the hotel was adequate. The elevator in this hotel was small but it was really well-maintained.", "The hotel is great and very recommendable. It is a little bit of a distance from St Mark's but otherwise very good. The location of this hotel is great. It's within walking distance of most tourist attractions but isn't far from the railway station if it's needed. It is close to the main boat routes as well. Views of the canal from the rooms are amazing. The rooms are gorgeous and the room also had a twin basin bathroom which was a great bonus. The staff will make any visit to this hotel really memorable. Every member of staff have loads of great advice and recommendations for the local area from sight-seeing to restaurants, and even provided a map with best routes, Here at the hotel the breakfast food that's served is okay. The hotel had a small elevator but it was in good condition.", "This is a gem of a hotel that is highly recommended if you want a memorable stay. It is easy enough to walk to main tourist attractions from this hotel but there are transport links that are close to the hotel should your feet get tired. Overall this is a great and lovable location. There were great views from the blue room in this hotel and it had plenty of room inside. There are gorgeous chandeliers provide a luxurious touch. The staff are very welcoming here, and are well equipped to provide guests with directions and recommendations. Very helpful at all times, and do everything they can to make each guests's stay memorable. The breakfast food at the hotel was okay. A small, yet well maintained elevator in this hotel."], "common_summary": ["The staff at the hotel are friendly and helpful with a great breakfast provided. The rooms in the hotel are small but clean.", "The hotel whilst small did boast greatly friendly and helpful staff. The hotel rooms were really clean and morning buffet breakfast was always excellent.", "This is a friendly small hotel with very nice and helpful staff."], "entity_a_uid": ["UR42395251", "UR6109834", "UR60099205", "UR73571982", "UR56659720", "UR10040499", "UR10151117", "UR125599506"], "entity_b_uid": ["UR99144485", "UR3998784", "UR5602503", "UR10721583", "UR5813853", "UR83506882", "UR6232922", "UR4069022"]}, {"entity_a": "294931", "entity_b": "1948202", "entity_a_summary": ["The hotel is a tranquil escape from the bustle of the Old Town. It is decorated in a modest and antiquated fashion. If you ask at this hotel you can get an amazing room with a sea-view. The bathroom seems updated and features a really great pressure shower. The continental-style breakfast was really good and served on the rooftop terrace. There are really great views at this hotel. Additionally found that their slippers are really comfortable and don't feel cheap.", "This hotel provides a lovely and thoroughly enjoyable stay. The rooms in the hotel are comfortable and some rooms can have a sea view. The bathroom was modern with a great pressure shower. The continental breakfast served on the roof is delicious. Drinks are a good price and served until 11pm on the roof terrace. The slippers provided by the hotel are long-lasting and very comfortable.", "This excellent hotel with the antique style decor is full of charm. Very enjoyable. The location is next to loudspeakers of multiple mosques. The rooms were clean and some offered views of the sea. They were comfortable for adults and young children and had a modern bathroom with great water pressure. Breakfast is a nice buffet continental style meal and drinks are available on the roof terrace until 11pm. The room came with really nice slippers."], "entity_b_summary": ["The hotel is simplistic and clean and a quaint family run establishment in Istanbul. The rooms were a good size with comfortable beds that were not cheap. The staff spoke excellent English. The hotel provided a varied selection at breakfast amidst a lovely atmosphere. Once the roof terrace work is finished on the hotel it will be even better.", "This hotel presented itself as brand new, excellently clean and is a lovely family-run affair. It is definitely recommended on any visit here. There are a selection of restaurants within walking distance and a short taxi ride away from the Chora church, Spice Bazaar etc. The rooms at this hotel are well-sized and always clean. The beds are expensive and really comfortable. Despite not having an actual restaurant the hotel provides a breakfast that's really diverse and full. There will be a roof terrace to this hotel that will make the hotel itself even better than it already is.", "A simple, family run hotel that offers brand new facilities and is well maintained to a very high standard. There are many restaurants to choose from as well. Rooms were particularly spacious and you can tell they are well maintained and cleaned regularly. All staff speak excellent English and are always there for a conversation. The hotel does not have a restaurant but does have a cozy breakfast room with plenty of good food. A new roof terrace is soon to be available at this hotel, providing guests with a beautiful area to rest during their stay."], "common_summary": ["The hotel is in close proximity to all of the tourist sights and it definitely recommended. The staff are friendly and couldn't seem to do enough to help with anything.", "This hotel has a superb location for accessing major tourist sights of the city. The staff are also really friendly. They offered local knowledge for the places to visit a nd were incredibly accommodating", "The location of the hotel is great as is close to the Blue Mosque and other sights and the staff is friendly. The staff at this hotel are brilliant and very knowledgeable. They are always on hand to offer suggestions and answer questions from guests."], "entity_a_uid": ["UR70356908", "UR119487131", "UR86293303", "UR22821589", "UR60832305", "UR114593671", "UR106005900", "UR37030554"], "entity_b_uid": ["UR120025815", "UR124407840", "UR118311564", "UR128208969", "UR111140648", "UR102816166", "UR117271130", "UR120460830"]}, {"entity_a": "306156", "entity_b": "306173", "entity_a_summary": ["The hotel is particularly good value for money. The location is central and close to the City Hall. There is also a Burger King and a 7 Eleven convenience store nearby. The rooms in the hotel were clean but the decor was a little outdated and the rooms were too cold. The buffet breakfasts and dinners in this hotel is absolutely superb and there is even an a la carte lunch option. If that wasn't enough there is a great bar on the ground floor with really good tasty food, too. The internet provided at the hotel was of poor quality because it was so unreliable and you had to put a down-payment just to connect. However, there is a pool here at the hotel and that's really clean and of good quality.", "The hotel has good but not great amenities but it is okay value for money. It provides a clean, roomy, and comfortable stay. This hotel is located in a great spot and there was good access to all you could need. The rooms are cold and even the non-smoking room smelled of smoke. The hotel has a good selection of food available. From the breakfast buffet, a la carte lunch menu and buffet dinner, there is a lot to choose from and reasonably priced too. Some hotel packages include meals in the Brasserie too. The hotel is situated quite high up so can be exhausting. The pool in the hotel is very clean. There is a $10 charge for use of the internet.", "Good hotel for a reasonable price, compared to others in the area. Well maintained for guests and is currently being upgraded to a higher standard. The hotel's location is spot on. It's sclose to everything including a 7 Eleven convenience store and a Burger King. Reasonably sized rooms that have been cleaned to a good standard. The main issue however is that these rooms are noticeably colder than what would be comfortable for guests to stay in. There is a great buffet for breakfast and dinner available and the bar on the ground floor has nice food. A smart, well maintained hotel. However, there is a down payment for the internet which doesn't provide the most reliable service."], "entity_b_summary": ["This stunning hotel will blow your mind because it is so majestic and great. If you stay here you will want to return again and again. The location here is great especially because the subway is easy to reach on foot. The rooms of the hotel were adequate but the toilet, bed and television were on the upper floor of the room. The free-flowing champagne provided during tea made up for the disappointing food. The exterior of the Fullerton Hotel is particularly beautiful at night.", "The exterior of the Fullerton Hotel is picturesque and often the focal point for passers by and photo opportunists. The hotel constantly meets expectations. The hotel is located in the business centre and one of the few hotels to be situated in the financial district. The rooms are to a high standard, and are medium sized. However, the facilities and TV are all inconveniently on the upper levels which can be frustrating. The food is not great but there is free champagne available. This hotel is spectacular and beautiful all the way from the lobby to the guestrooms.", "From the outside the hotel is beautiful. Inside the lobby and the rooms are great. Overall it is cheap for all you get. The location of this hotel is excellent, as it is central to the financial district. It is one of very few hotels in this area, so it is an excellent base for those needing to be in close proximity to the business centre. The rooms aren't exceptionally big but they are good enough. The food at this hotel is mediocre and quite bland. The decor used for this hotel on both the indoor and outdoor is beautiful, and really stands out. Marina Bay is also walking distance away and is a great way to start the day."], "common_summary": ["The hotel is closely located to the MRT. The service from the staff here is unbeatable as they are all very friendly and love to offer suggestions when asked. ", "This hotel is superbly located and close to the MRT system. The staff at the hotel were incredibly helpful and friendly.", "This hotel is located very near the MRT. The staff at this hotel were great. They were helpful, friendly, and offered great suggestions when asked."], "entity_a_uid": ["UR118045925", "UR21665169", "UR18557592", "UR98181258", "UR75856922", "UR16076201", "UR100722350", "UR123352070"], "entity_b_uid": ["UR46520956", "UR118352504", "UR101403153", "UR126469468", "UR105749873", "UR116771948", "UR68811203", "UR122447166"]}, {"entity_a": "306176", "entity_b": "1770798", "entity_a_summary": ["The hotel's furnishings is a bit outdated and need updating but it was very clean. This hotel has great central location; it is very close to many attractions, like MRT, Clarke Quay , and the National Museum. The bed was comfortable and the full size bath was a nice bonus. The isolation is bad so the elevator and neighbor speaking could be heard very clearly. The other downside is the lack of style and no wifi in the room. Disappointing breakfast. Very limited choices with no fresh fruit. This hotel has a very small pool.", "The hotel is clean but is perhaps in need of a restoration, as the furnishings and general decor are a bit old fashioned. The hotel has a great centralized location and conveniently close to MRT, Clarke Quay and the National Museum. The room was next to a noisy area near the elevator and though the bed was comfortable the bathroom was so small only one person could fit in it at a time but it did offer a full-sized bath for relaxing in. Some rooms have not yet been renovated and are run down and there was no wifi in the room. Particular mention should go to Ms Kripa at the club floor. Aside from bananas and apples, the hotel's breakfast choices were limiting and disappointing as they had no other fresh fruit on offer. The hotel has a very small pool.", "This hotel is central and ideal for travelling and though it is a little outdated and absent of style, it is clean in the rooms and restaurants. It's a great place to stay three or even four times a year or even for a first trip to the city. A central location and conveniently located. to MRT, Clarke Quay and the National Museum. The hotel bedroom has a comfortable king size bed, but the decor is a bit lacking. The bathroom was small and there was no wifi in the room. Some of the rooms in the hotel have not been renovated and are run down. The hotel provides a limited breakfast option, with a small selection of fresh fruits. The hotel has a small pool which is adequate."], "entity_b_summary": ["The hotel is an amazing 'Las Vegas style' building, with a shopping centre and convention centre attached to it. The hotel is definitely recommended, but there are possibly more personal venues to stay at whilst in Singapore. The location is pretty great with a mall close-by too. The club room was quite fantastic although a little bit noisy because of the traffic, however the decor was contemporary and room nice and spacious. The bathroom was also really big including the bath. The staff allowed for early check-in and also the check-out process was really easy and quick. Overall the staff service is really satisfying. The food is good here but a little bit overpriced. The hotel has live music in the fuse lounge. The pool is not very private and the foyer is too busy.", "This is a highly recommended Vegas-style hotel that even has a shopping mall attached. Not only that but it has a simply amazing rooftop pool, which adds to how special this hotel is. The building itself is quite a marvel. The hotel is located near to the Gardens by the Bay, but make sure to check that the venue is open when you stay. The hotel has large rooms with a large en-suite and modern decor. The premium rooms are more expensive. Overall the rooms are excellent. The hotel staff allowed for early check in and an efficient check out. The food hall in the hotel was a little disappointing. It was too crowded and the quality was okay. In the evening there was live music playing. Sometimes there were queues for checking in and checking out, though.", "There may be more personable hotels in Singapore but this building is amazing. It is a must-see and has a rooftop infinity pool, a shopping mall and convention centre attached to the hotel. The location was okay. The pool complex is great and the Skypark is always busy and wonderful. It is a very special experience. The rooms were large with contemporary decoration and had a large bathroom and a separate shower. Nice rooms. The food at this hotel is generally okay, however the foodhall can become very busy and is overpriced for what you get. There is little privacy for the guests staying at this hotel who want to go for a swim, as visitors to surrounding areas can easily look through to the pool."], "common_summary": ["The hotel is located close to the MRT and the staff are friendly. There is a great city view from this hotel.", "The location of this hotel is really convenient and their staff were wonderfully friendly. The hotel has beautiful views. ", "The staff at this hotel is very friendly. The hotel has a beautiful view. "], "entity_a_uid": ["UR45713813", "UR13925805", "UR52889297", "UR39542295", "UR119783551", "UR82081584", "UR122305063", "UR120857541"], "entity_b_uid": ["UR119916911", "UR126093015", "UR93913941", "UR126818218", "UR125614761", "UR98042025", "UR122212681", "UR124554465"]}, {"entity_a": "256595", "entity_b": "256544", "entity_a_summary": ["This hotel may not be the right option for some. The hotel is only a five minute walk from the Town Hall rail station and you can also walk to shopping and tourist attractions from the hotel. The hotel is also close to Darling Harbour. The corner-room was of an okay size and really cleaned to a high level. Check-in to your room can be earlier if you ask. The staff were quite nice overall but sometimes seemed to be put off and lacking. The breakfast provided by the hotel was Continental., but there were problems with not being on the necessary list. The hotel's restaurant was good., but slightly expensive. The hotel were very helpful with pre-booking information, but check out of the stay was drawn out and frustrating.", "Everything you could need is only a short walk away from this hotel so it is is located in a great spot. There is also a rail station nearby as well if choosing to go further afield. The rooms are quite large . They are also spotless , quiet and really comfortable. The staff of the hotel were generally helpful and courteous, although the reception was sometimes less professional when dealing with issues. The restaurant provides really good meals even if the prices are a bit high. You can ask about checking in early but bear in mind that this hotel's checking out seemed to be quite long.", "Brilliant location for those looking to sight see, with most of the main attractions only walking distance from the hotel. The room had a great view of the city and some even had balconies. Not all of the rooms aren't big but are clean and comfortable. In general, the staff at this hotel are very nice and helpful. However, at times the service can be disappointing and customers can be made to feel like they are an inconvenience. Although the prices are quite expensive for the food at this hotel, it is a decent quality. Breakfast comes included in the rate which is a positive, however it is only the basic continental that you would get at many other hotels and nothing different or exciting to look forward to. The hotel offered a nice response when asked about early check-in, however, signing out took far too long and was frustrating."], "entity_b_summary": ["The room lacked some personality and was pretty small and plain, but it did have a big bed and some nice toiletries available. The hotel has a buffet breakfast and you can enjoy a cocktail overlooking the harbour. The WiFi was surprisingly a paid service but on the positive side the pool area on the roof is really pretty. Another positive is that the gym is perfectly adequate even if it is small.", "The hotel is at the lower price point for a Four Seasons hotel. The location is basically perfect because there are great transport links and really nice views from the hotel. The rooms in the hotel are very small, but the beds are huge and large plush robes are provided. Service from the staff was absolutely excellent. The breakfast buffet was absolutely superb. Additionally the evening cocktails overlooking the harbour are really recommended, too. The pool and gym facilities at the hotel were great but unfortunately the WiFi available had a charge.", "An expensive hotel and doesn't seem quite up to par with other Four Seasons hotels. The location is one of the perks to staying at this hotel, with public transportation very close by for guests to go and sight see without the stress. The rooms in this hotel were too small and lacking in character or were plain although the bed was large and the views were very nice. The buffet breakfast was very nice. A variety of amenities on offer, including a swimming pool and gym, for the guests' pleasure. The pool in particular is delightful as it is based on the roof of the hotel. However, this hotel doesn't offer free Wi-Fi, which is inconvenient as many other hotels are starting to offer it in this day and age."], "common_summary": ["This was a really enjoyable hotel to stay in and would choose it again for sure. The hotel is highly recommended.", "Overall an enjoyable stay. This is a very recommended hotel.", "It is worth it for the enjoyable stay. This hotel is highly recommended."], "entity_a_uid": ["UR121090123", "UR108896773", "UR127177828", "UR50577467", "UR24890228", "UR104859437", "UR20384136", "UR10687212"], "entity_b_uid": ["UR39016181", "UR55974598", "UR39911562", "UR125364568", "UR116218531", "UR6719833", "UR4730151", "UR103172165"]}, {"entity_a": "285271", "entity_b": "940178", "entity_a_summary": ["This is a perfect hotel for a short stay and highly recommended because of the great value for money. The hotel is in a great location if you're looking to visit the Musee d'Orsay or Saint Germain area . Firstly the rooms are designed to be really unique and it shows, but this doesn't compromise the plethora of mod-cons supplied such as iPod dock, minibar, a flat-screen television. There is nothing you could need that isn't available. Whilst very lux inside the room it's very relaxing and charming. The staff at this hotel are really caring with a great attitude. The breakfast provided by the hotel was suitable stocked with fresh, organic produce and there was plenty of food available. The ticket provided by the hotel allows for skipping the line at designated venues.", "The hotel is great value and ideal for a short stay. The hotel is very close to the Musee d'Orsay and is within walking distance of the Saint Germain part of Paris. The design of the hotel rooms was stylish and colourful. The room was relaxing and included all the extras such as flat screen television, iPod docking station, safe etc. A clean and elegant room. The staff at the hotel had a compassionate attitude to guests. The bountiful breakfast had generous offerings which even included organic products. The hotel provides a ticket to skip the queue, which is a great bonus.", "This is a really nice, beautiful hotel for short stays and is a great value. This hotel is in a great, central location to some of the main attractions. Although the Christian Lacroix designs are dramatic and will not suit everyone's taste, each room is unique, stylish and has all the mod cons needed for a comfortable stay. The rooms are on the smaller side, however they are spacious enough and provide convenience and charm, making this a lovely room to stay in. The hotel had very caring staff. This hotel provides organic breakfast options. Tickets from the hotel mean you don't have to wait in the line."], "entity_b_summary": ["The stay at this hotel was really great and enjoyable. It was a memorable experience at what seemed to be a totally new hotel. This location was pleasant and located in a tree-lined avenue that was used by locals. The hotel room had a lovely view of the canal, with the rotunda and Stalingrad station in the background. A decent sized room with a large bathroom, although without a bath. Clean and tidy room with a comfy bed. Some of the staff at the hotel were helpful, but some had an unprofessional attitude. The hotel served simple French cuisine with a view of the canal, but the breakfast's hot items would go quickly. The hotel has secure parking available below the complex. It is worth nothing that one of the lifts may be out of order, so it takes a little longer to get the other lift.", "This hotel seems like it is brand new which is a plus. It is in a picturesque setting and is simplistically clean. The hotel is situated in a good location just outside Paris with two cafe bars nearby. The super clean room had incredible views of the canal and the boats there. Not only that but the beds were both large and really cosy. There was every facility you need apart from having a shower instead of a bath, but that's fine for most people. The staff are pretty helpful and at times they were extraordinary. The hotel offered a basic breakfast. There is secure parking underneath the hotel. There are also lifts provided, which can be a bit of a wait but there are also stairs to use.", "This hotel is a great option for those visiting Paris with a specific price range in mind, as it is a gem in what can be pretty bad accommodation in regards to this standard. The setting is lovely and really suited to its surroundings, making it a simple yet effective choice. Ideal location just on the outskirts of the main city, with multiple cafe bars close by for guests to enjoy if they fancy leaving the hotel. However, it is not in walking distance from the main station which can be off putting for some. The views from the rooms overlook the canals with its boats and looking onwards to the rotunda near the metro station in Stalingrad. There is also a good-sized bathroom with a great shower, though no bath and the room itself was clean and very large. The bed is comfortable and the rooms included all the expected facilities, an internet connection, and coffee or tea. The service was okay, as the staff generally try to be helpful where they can. But it could be better at times. The French food served nearby the hotel was simple but proper, it was a great place to eat. Sadly the hot but standard breakfast options were gone by a certain time in the morning. The hotel has the option of parking beneath the hotel and it is secured and although there were issues with the lift, stairs were available for use."], "common_summary": ["The hotel is in a great location, close to the metro and highly recommended. The staff were friendly too.", "This is a well-located hotel that is close to a Metro station, which is very convenient. It is highly recommended for a weekend get away and boasts highly friendly but professional staff.", "This hotel in Paris is highly recommended and the staff are friendly."], "entity_a_uid": ["UR59421297", "UR27530547", "UR53728738", "UR120605813", "UR118182230", "UR20533044", "UR122466836", "UR64107500"], "entity_b_uid": ["UR59937766", "UR113690822", "UR120983134", "UR114819905", "UR30661898", "UR72292331", "UR119195194", "UR36907989"]}, {"entity_a": "254348", "entity_b": "183258", "entity_a_summary": ["After booking directly with the hotel it was really impressive and made for a very special weekend. This is the place to be. The hotel was situated close to a metro station, allowing travel to the restaurants of Old Montreal and within walking distance of the Montreal Jazz Festival. The rooms are adequately sized but are clean and with elegant furnishings. The rooms retain some history from its previous incarnation as a bank. The rooms have free WiFi available with lovely modern art too. The hotel has a good bar that is ideal for relaxing whilst listening to some live music. The hotel had no street noise at all and on Friday and Saturday evenings there was a music group playing at the bar area.", "The hotel is decorated with lots of desirable artwork. There is also a lobby that is home to live bossa nova music and a good bar for guests. This hotel is ideally situated to explore the Old Town on foot and the metro stop is easily accessible by walking a few blocks, which can take you to some great shopping locations as well as restaurants. The tall ceilings in the rooms provide a larger feel to an otherwise average-sized room. However the furnishings are elegant and stylish therefore provide quite a charming feel to the room. This hotel is a great place to drink some wine and appreciate the great music they play here. The atmosphere at the hotel was very good as there was no street noise. There was also a bossa nova group that played the hotel on weekend evenings too.", "This is a great hotel to stay at over and over. They have live bossa-nova music, a bar, and very impressive art on display worthy of being in a museum. The lobby is welcoming and lovely but the hotel overall is very special. This hotel is conveniently located within walking distance of shops, the restaurants of Old Montreal and even the subway. The Montreal Jazz Festival, as well as the entire Old Town, are also located within easy walking distance. This hotel was formally a bank. Rooms differ from one another but retain the elegant touches of its past. They are clean, comfortable and individual but not large, though the high ceilings give the illusion of spaciousness. There is free WiFi and comfortable beds and have been decorated with modern art. Have a seat, listen to some music, and drink some wine. Excellent. No street noise but the bar area comes alive with a bossa nova group on Friday and Saturday nights."], "entity_b_summary": ["This hotel never disappoints during your stay, whether it's for a shopping weekend or something else it's a great place to stay. The hotel is in the centre of Montreal's shopping district. It is close to McGill University as well as Ogilvy in a safe part of the city. There are some really cool and handy features and amenities included in the rooms such as iPod docking station, a pressure shower, DVD player and television and Jacuzzi tub in the bathroom was great. The rooms were spacious and luxurious at the same time. The breakfast provided via room service was really tasty. There was a garage to park your car.", "The Hotel Vogue is the perfect hotel for a shopping weekend in Montreal or a romantic trip with a loved one. This is a hotel located in a safe area within walking distance of pretty much everything you could need. The rooms in the hotel are a good size, with lots of amenities such as iPod docking stations, a television and even a Jacuzzi hot tub. The executive suites are particular spacious with two televisions too. The breakfast food provided by the hotel's room service was very good. You can park your car in the garage if you prefer to drive here. The shower was a little old but the water pressure was great.", "The Hotel Vogue does not disappoint for shopping or romantic getaways and is well maintained. The Vogue is in a great location at the heart of Montreal's shopping district and within walking distance to so much more. Lovely rooms that are fully equipped with all amenities and luxuries. The bathrooms are superb and come with tv and Jacuzzi tub. They are spacious, and the beds are comfortable. The hotel does have a very nice breakfast."], "common_summary": ["The staff at the hotel were accommodating to guests.", "The staff are really welcoming and friendly at this hotel.", "The service provided at this hotel is of a very high quality, and the staff are always very friendly."], "entity_a_uid": ["UR3817666", "UR10664243", "UR8525383", "UR6627791", "UR117365407", "UR97284865", "UR115324832", "UR115634262"], "entity_b_uid": ["UR10751859", "UR11594204", "UR121103494", "UR19348213", "UR15292707", "UR7725127", "UR92373474", "UR36062146"]}, {"entity_a": "636215", "entity_b": "574376", "entity_a_summary": ["The hotel was a bargain and comes highly recommended. The hotel is located centrally to the main strip and generally everything is within walking distance. It is a minute's walk to beach and nearby 4th street has a selection of local restaurants too. The rooms were clean and well maintained. They were reasonably priced and the deluxe options have a balcony overlooking 5th Avenue. The staff are incredibly knowledgeable about the local area and will happily spend some time advising on the best places to see. They were even gracious enough to book taxis to the airport, which is a great touch. The hotel is near to Rancho Punto Venado, which provides facilities for many outdoor activities such as horseback riding and ATV driving", "This hotel is highly recommended because not only is it a bargain but it's beautiful, bright, comfortable and above all else it's clean. Everything is super close to this hotel as it is in a great location; the beach is only one minute's walk away, there are great locals' restaurants 100 yards from the beach as well so that adds to the experience. The larger deluxe rooms have a nice partial view of the ocean because of the balcony, and the room was really clean and well-kept. The hotel staff were very helpful. They booked local restaurants and transport to the airport and made the stay more pleasurable. The breakfasts served here were really nice. There are great activities close to this hotel to participate in, which really adds to a trip.", "Highly recommended, and great value for money. Everything needed to make it a good visit is available to guests. Hotel Cielo's location is only a minute's walk from the beach and within walking distance to nearly everything. Beautiful rooms that are reasonably priced and well maintained. Stunning views from the room's balcony are available to those willing to pay slightly more. The staff here were amazing and took care of every need, from sorting out restaurants and taxies to offering tips and advice on travel which improved the overall quality of the trip greatly. The breakfast served here is of very good quality. Off the hotel grounds, there are activities such as horseback riding, beaches, and jeeps along with ATV's and at Rancho Punto Venado, a bar and buffet."], "entity_b_summary": ["The hotel even has a kids' club. The hotel is conveniently near the tram system and there are great views of the coast. An ideal choice for a quieter place to stay. One of the hotel rooms is a suite that is simply superb. The staff were generally friendly, but requests were not always met efficiently. The hotel provides great food, although some of the dishes are perhaps not too authentic to the region. The hotel provides internet access for guests. The hotel premises also have a pool and seating around it. If you upgrade to stay in a Casitas there is a view to the ponds of the grounds.", "This is a really great and fabulous hotel that will have you coming back again and again. This is a conveniently located hotel because there are trams nearby to take you to restaurants, while the hotel is a good distance away from the craziness of the city. Requests made to staff and even management are not always followed through despite repeating them. Overall though the staff are friendly and try to help out as much as they can. Whilst the food served in this hotel is undeniably tasty they should reconsider whether some of the items on offer are really authentic Mexican dishes. The hotel provides access to the internet and the pools are really great.", "Wonderful hotel with various activities available for kids via the kids club. Away from the hustle-bustle of Cancun with trams available when necessary and close to restaurants and the coast. A really great location. The suite in this hotel was fantastic. In general, the staff is very friendly and helpful but management could work on their follow-through. The food here is good but not always authentic Mexican food. There are plenty of lounge chairs available at the many pools. And you can rent a car to experience driving in Mexico."], "common_summary": ["The hotel is in a good location and has friendly and helpful staff there.", "Everyone here are really friendly and always so helpful without being intrusive. The rooms are simple but comfortable and spacious, additionally the location is amazing.", "The hotel is in a great location and the staff are most helpful and friendly."], "entity_a_uid": ["UR23496931", "UR58260691", "UR103823862", "UR125056421", "UR100022902", "UR25517817", "UR22454532", "UR17179913"], "entity_b_uid": ["UR68617267", "UR57265172", "UR126039320", "UR117835190", "UR66874185", "UR116284283", "UR123854236", "UR123684224"]}, {"entity_a": "482693", "entity_b": "1547281", "entity_a_summary": ["The hotel was a unique experience with traditional and modern features. A stay at the hotel comes highly recommended. The hotel is situated in an excellent location on the Grand Canal, only a couple of stops to San Marco Square and near to the Salute Church. It is close to a number of art galleries and the Vaporetto. The hotel has rooms overlooking the canal that are nice and clean. The hotel has a simple menu which can be served wherever you like. The minibar is always stocked for guests. Despite being a bit overpriced the hotel did live up to that expectation, so it was worth it.", "This is a great stylish contemporary hotel that pays attention to every detail and one that cannot be recommended enough. This boutique hotel is perfectly located because it is on the edge of one of the greatest areas and away from tourist hordes, making it quiet. Despite the calm location it isn't too far away from good sight-seeing spots and there is no problem getting around the city. The rooms are well-maintained and clean, but there is quite a walk up to the room if staying on the top floor. . The breakfast is of the highest quality, and there is the option to eat in either the breakfast room or the roof terrace. The stay at the hotel was a little expensive.", "This is an exquisite hotel that is highly recommended. The decor has an excellent mix of contemporary and traditional design that will appeal to the majority. They have paid attention to every detail when designing this hotel. Great location for those wanting a good base to go on and sight see, as it is close to many of the tourist attractions. Most sites are walking distance from the hotel, yet the hotel itself is in a more remote location that offers guests peace and quiet if they choose it. The rooms are very well maintained and clean and though not as distinct as the public areas is unique in its own right. Some overlook the canal.Breakfast is little bit lacking but tasted good."], "entity_b_summary": ["This is a beautiful hotel and possibly one of the best out there. The rooms in the hotel are decorated in a typical Venetian style, but with modern design twist, such as mirrors housing televisions. The highest room available in the hotel has a sky window which was very quiet too. The breakfasts at the hotel were made fresh and could be enjoyed on the terrace. This is a hotel of high standards and qualities and everything seems to be really thought through such as where the plug sockets are place and even the light switch.", "The hotel setting is beautiful but it's an uncomfortable boat ride to get there. Good location with walking paths in close proximity to the hotel. Free water taxis can be taken also, however they are not highly recommended. The Venetian-style rooms are absolutely beautiful and had a sky-window to allow you to view the sky at nighttime. There are flat-screen televisions hidden behind mirrors which is a unique touch. Some of the staff were unhelpful, The complimentary breakfast can be eaten on the terrace and it is an absolute gem. The croissants are clearly made fresh and so they tasted amazing. The hotel will look after guests late at night if you need collection for a charge. The attention to detail goes all the way down simple fixtures like light fittings etc.", "This is an average hotel to stay at, however it is in a beautiful area that has lots for tourists to see. The hotel was a little difficult to get to but they will provide a nicely detailed map for walking paths nearby, because it is located in a lovely place. The rooms are to a very high standard, with exceptional views overlooking some of the popular attractions in this area. The upgraded rooms in particular are wonderful, with a sky window that opens up at night. They are beautifully decorated and provide all amenities for a good stay. The staff occasional go above and beyond to help their guests. The food was delicious. Freshly made croissants and a free bottle of Prosecco, excellent. A bargain hotel that provides good quality service. You can see there has been great efforts put in place to decorate all aspects of this hotel, down to the small details."], "common_summary": ["The staff were very helpful to guests.", "The staff are all so helpful and great here.", "The staff at this hotel are very helpful."], "entity_a_uid": ["UR4462165", "UR4998469", "UR30135578", "UR6623675", "UR4328785", "UR107878866", "UR10355450", "UR62349429"], "entity_b_uid": ["UR94940115", "UR79532970", "UR115165365", "UR54953715", "UR94189282", "UR117387352", "UR50326769", "UR118468512"]}, {"entity_a": "292894", "entity_b": "239263", "entity_a_summary": ["It was such a comfortable experience here at this hotel and nice bonus there was classical music that came from a nearby opera school. Excellent location for that is on a quiet street, but also allow easy reach for principal city sights; the metro and city tour bus stop are really close. Clean and large room with a great renovated bathroom. The staff are a wealth of knowledge about the nearby restaurants , side trips, which was was super helpful. The breakfast not only has lots of choice but the quality of the continental foods and drinks on offer was great. They also provide take away breakfast. No wireless internet in the rooms, only available in the lobby.", "The Oceania is a 2 - 3 star hotel but where it lacks in its grandeur it makes up for it with its staff. There is also the enjoyable music in the air from the nearby opera school and the hotel is not only comfortable but clean. The hotel's location is excellent. It lies just off of the Piazza della Repubblica on a quiet street and is close to buses and trains to allow reaching the city and sights easily. The hotel had a spotlessly clean, old double room with a great renovated bathroom. Breakfast was an ample continental breakfast with bread, pastries, juices, and coffee. it was lovely and you can get it to take away if you need to leave early. The Internet was only available in the lobby.", "The Hotel Oceania has classical music from the opera school below drifting up, which is very beautiful and atmospheric. The hotel is in an excellent location. It is situated on a quite side street close to Piazza della Repubblica, the metro and the principal sights of the city. The hotel's rooms are clean, spacious and with a renovated bathroom. A continental breakfast including breads, pastries, juices and coffee. There is the option to take away if needed. The hotel provided internet in the lobby,"], "entity_b_summary": ["The hotel seems to be missing the personal details and it is perhaps slightly overrated. This hotel is beautifully set for walking to great sites of the city as well as shops and outdoor restaurants located close-by. The small complex that the hotel is located within had some beautiful orange trees as well, adding to the colourful neighbourhood. The rooms here are really lovely although were a bit noisy with doors banging. The breakfast buffet was really tasty if a little bit basic. The scrambled eggs are highly recommended. There was some noise coming from the bells of the nearby church therefore it is recommended to bring earplugs.", "This hotel provides a wonderful, cosy and convenient place to stay. It is a little pricey however it's really charming. The hotel is ideally situated for local restaurants, being only a stone's throw from Santa Maria Maggiore and Ponte Sisto too. The hotel is close to a tram link to the airport, Tivoli and other areas in Rome. It was great that the rooms opened onto the courtyards but this and the tiled floors made them rather noisy. The hotel's breakfast was adequate but was nice to enjoy in a courtyard of orange trees. It is worth mentioning that the bell chimes from a nearby church can clearly be heard in the rooms, which may be a negative for some guests.", "This hotel is a very nice and convenient base to explore Rome and the Vatican from but lacks a personal touch. It is cozy and charming but maybe overrated a little. This hotel is ideal for restaurants and in the middle of Trastevere and is only a block away from Santa Maria Maggiore and Ponte Sisto and within walking distance of the center of Rome, Campo Fiore and Janiculum. It is also not far from the tram with connections to the airport and there are lots of shops and beautiful colorful neighborhoods all around. The rooms are lovely in that there is the option for them to be opened out into the open air with the courtyards. However, the rooms can be become rather noisy due to the tilen floors and the doors that bang. There were not many staff here. Generally a very good buffet breakfast that offers scrambled eggs and cappuccino amongst other things. There is also access to the lovely courtyard that is covered in orange trees for when you want to eat your breakfast. The bells from the nearby church could cause sleep issues."], "common_summary": ["The rooms of the hotel are clean and the staff are helpful.", "This hotel features nice clean rooms and very helpful staff.", "This hotel has very helpful staff and the rooms are very clean."], "entity_a_uid": ["UR37650228", "UR122756295", "UR8703059", "UR3925793", "UR114093264", "UR128066405", "UR29857063", "UR11027429"], "entity_b_uid": ["UR7839302", "UR3015805", "UR3294271", "UR55381933", "UR54908740", "UR95184087", "UR4477840", "UR112721290"]}]}